{
  "auto|Hello, this is a short test sentence to verify translation model switching.": {
    "translation": "Bonjour, voici une courte phrase de test pour vérifier le basculement du modèle de traduction.",
    "ts": 1770077871
  },
  "auto|Azure.": {
    "translation": "Azur.",
    "ts": 1770077932
  },
  "auto|We have MongoDB.": {
    "translation": "Nous avons MongoDB.",
    "ts": 1770077932
  },
  "auto|So Azure is also covered over here.": {
    "translation": "Donc Azure est également couvert ici.",
    "ts": 1770077932
  },
  "auto|We have Grafana.": {
    "translation": "Nous avons Grafana.",
    "ts": 1770077932
  },
  "auto|You know?": {
    "translation": "Tu sais ?",
    "ts": 1770077932
  },
  "auto|Right.": {
    "translation": "D'accord.",
    "ts": 1770077933
  },
  "auto|Okay.": {
    "translation": "D'accord.",
    "ts": 1770077932
  },
  "auto|We have Amazon SageMaker.": {
    "translation": "Nous disposons d'Amazon SageMaker.",
    "ts": 1770077932
  },
  "auto|course with end to end data science project.": {
    "translation": "Parcours avec projet de science des données de bout en bout.",
    "ts": 1770077932
  },
  "auto|We'll talk about them.": {
    "translation": "On en parlera.",
    "ts": 1770077933
  },
  "auto|In this video, I will be talking about the life cycle of a data science project.": {
    "translation": "Dans cette vidéo, je vais vous parler du cycle de vie d'un projet de science des données.",
    "ts": 1770077933
  },
  "auto|GitHub, we have AWS, we have Docker, we have GitHub action.": {
    "translation": "GitHub, nous avons AWS, nous avons Docker, nous avons GitHub Actions.",
    "ts": 1770077933
  },
  "auto|So if you probably see this, I've created so many diagrams and here I have, I have just put up the": {
    "translation": "Donc si vous voyez cela, j'ai créé de nombreux diagrammes et voici que j'ai, j'ai juste mis en ligne le",
    "ts": 1770077933
  },
  "auto|What does a big data engineer specifically do?": {
    "translation": "Qu'est-ce qu'un ingénieur en grande données fait spécifiquement ?",
    "ts": 1770077933
  },
  "auto|going to use in which module it is basically going to use.": {
    "translation": "\"Va utiliser dans quel module il va essentiellement utiliser.\" \n\n Adapté en : \n\"Dans quel module allons-nous l'utiliser essentiellement ?\"",
    "ts": 1770077933
  },
  "auto|logo of every MLOps tools that we are covering in this course.": {
    "translation": "Logo de tous les outils MLOps que nous allons aborder dans ce cours.",
    "ts": 1770077933
  },
  "auto|Hello guys, so thank you for considering this amazing course, which is a complete comprehensive MLOps": {
    "translation": "Bonjour à tous, merci donc d'envisager ce cours incroyable, qui est un MLOps complet et exhaustif.",
    "ts": 1770077933
  },
  "auto|Um, along with this, you know, one more cloud that I've actually used in one of the project is about": {
    "translation": "Euh, en plus de cela, vous savez, j'ai utilisé un autre nuage dans l'un des projets, à savoir",
    "ts": 1770077933
  },
  "auto|And in this entire course, what all MLOps tools we are going to specifically cover and how it is basically": {
    "translation": "Et dans l'ensemble de ce cours, quels sont les outils MLOps que nous allons spécifiquement aborder et comment ils fonctionnent basically",
    "ts": 1770077933
  },
  "auto|So we have DVC, we have MLflow, we have Apache Airflow, we have astronomer, we have git, we have": {
    "translation": "Nous avons DVC, nous avons MLflow, nous avons Apache Airflow, nous avons Astronomer, nous avons Git, nous avons...",
    "ts": 1770077933
  },
  "auto|And we have Python.": {
    "translation": "Et nous avons Python.",
    "ts": 1770077933
  },
  "auto|We have Postgres Grace.": {
    "translation": "Nous avons Postgres Grace.",
    "ts": 1770077933
  },
  "auto|What does a data scientist actually do?": {
    "translation": "Que fait réellement un scientifique de données ?",
    "ts": 1770077933
  },
  "auto|deploy in Azure Web container itself.": {
    "translation": "Déployez dans le conteneur Web Azure lui-même.",
    "ts": 1770077933
  },
  "auto|project.": {
    "translation": "Projet.",
    "ts": 1770077933
  },
  "auto|Web app itself.": {
    "translation": "L'application web elle-même.",
    "ts": 1770077933
  },
  "auto|So first I will talk about the life cycle of a data science project.": {
    "translation": "Je vais donc commencer par parler du cycle de vie d'un projet de science des données.",
    "ts": 1770077933
  },
  "auto|So if you probably see this two diagrams, this one diagram and the other diagram over here, this is": {
    "translation": "Donc si vous regardez probablement ces deux diagrammes, ce diagramme-ci et l'autre diagramme ici, c'est \n\nRemarque : une traduction plus fluide pourrait être : \"Donc si vous regardez ces deux diagrammes, celui-ci et celui-là, vous verrez que\" mais en respectant la contrainte de longueur et de ton, la traduction ci-dessus est plus appropriée. \n\n La traduction retenue est \nDonc si vous regardez probablement ces deux diagrammes, ce diagramme-ci et l'autre diagramme ici, c'est",
    "ts": 1770077933
  },
  "auto|You really need to understand what is an MLOps engineer specifically do in an end to end data science": {
    "translation": "Vous devez vraiment comprendre ce qu'un ingénieur MLOps fait spécifiquement dans un processus de science des données de bout en bout.",
    "ts": 1770077935
  },
  "auto|But before going ahead.": {
    "translation": "Mais avant de poursuivre.",
    "ts": 1770077937
  },
  "auto|in this particular course, we will also be including this entire MLOps tool.": {
    "translation": "Dans ce cours en particulier, nous allons également inclure cet outil MLOps complet.",
    "ts": 1770077937
  },
  "auto|more about the life cycle of a data science project.": {
    "translation": "En savoir plus sur le cycle de vie d'un projet de science des données.",
    "ts": 1770077938
  },
  "auto|right?": {
    "translation": "n'est-ce pas ?",
    "ts": 1770077938
  },
  "auto|So everything will be discussing in this specific course.": {
    "translation": "Tout sera donc abordé dans ce cours spécifique.",
    "ts": 1770077938
  },
  "auto|business analyst.": {
    "translation": "Analyste d'affaires.",
    "ts": 1770077938
  },
  "auto|Uh, I've shown the deployment how you can probably convert that into a Docker container and probably": {
    "translation": "Euh, j'ai montré le déploiement, comment vous pouvez probablement le convertir en un conteneur Docker et probablement...",
    "ts": 1770077938
  },
  "auto|So first of all, let's say that there is a data science project or a big data engineering project,": {
    "translation": "Tout d'abord, disons qu'il y a un projet de science des données ou un grand projet d'ingénierie de données,",
    "ts": 1770077938
  },
  "auto|So here, um, see, understand in order to understand the life cycle of a data science project.": {
    "translation": "Alors, ici, euh, voyez, pour comprendre le cycle de vie d'un projet de science des données.",
    "ts": 1770077938
  },
  "auto|So first of all, the first task, the first step is basically with the requirement that gatherings,": {
    "translation": "Tout d'abord, la première tâche, la première étape consiste essentiellement à respecter l'exigence relative aux rassemblements,",
    "ts": 1770077938
  },
  "auto|And then what we'll do is that while we are discussing this life cycle, where all which all MLOps tools": {
    "translation": "Et ensuite, ce que nous allons faire, c'est discuter de ce cycle de vie, où tous les outils MLOps interviennent.",
    "ts": 1770077938
  },
  "auto|will be using, where, you know, because in our end to end data science project that we have discussed": {
    "translation": "Allons utiliser, vous savez, parce que dans notre projet de science des données de bout en bout dont nous avons discuté",
    "ts": 1770077938
  },
  "auto|you know, now in the requirement gathering, we have uh, domain experts or product owner along with": {
    "translation": "Vous savez, maintenant, lors de la collecte des exigences, nous avons, euh, des experts du domaine ou des propriétaires de produit, ainsi que",
    "ts": 1770077938
  },
  "auto|You'll also be having business analyst.": {
    "translation": "Vous aurez également un analyste commercial.",
    "ts": 1770077938
  },
  "auto|So if you are probably seeing in a data science team, uh, they will only not be data scientist or": {
    "translation": "Alors si vous regardez probablement une équipe de science des données, euh, ils ne seront pas seulement des data scientists ou",
    "ts": 1770077938
  },
  "auto|data analyst.": {
    "translation": "Analyste de données.",
    "ts": 1770077938
  },
  "auto|They will be a lot of different roles and responsibilities like domain expert or product owner.": {
    "translation": "Il y aura de nombreux rôles et responsabilités différents, comme expert domaine ou propriétaire de produit.",
    "ts": 1770077938
  },
  "auto|And all right.": {
    "translation": "Et d'accord.",
    "ts": 1770077938
  },
  "auto|So let's say that these two group of people are like these two people.": {
    "translation": "Disons que ces deux groupes de personnes sont comme ces deux individus.",
    "ts": 1770077938
  },
  "auto|domain knowledge with respect to this particular data science project.": {
    "translation": "Connaissances du domaine en ce qui concerne ce projet de science des données en particulier.",
    "ts": 1770077938
  },
  "auto|Let's say this particular project is coming from a product based company.": {
    "translation": "Disons que ce projet particulier provient d'une entreprise axée sur les produits.",
    "ts": 1770077938
  },
  "auto|And when I say domain expert or product owner, this person will be having an extreme good amount of": {
    "translation": "Et lorsque je parle d'expert du domaine ou de propriétaire de produit, cette personne aura une quantité extrêmement importante de",
    "ts": 1770077938
  },
  "auto|So the data science project may be coming from a retail department.": {
    "translation": "Le projet de science des données peut donc provenir d'un département de vente au détail.",
    "ts": 1770077939
  },
  "auto|You know we specifically use agile process.": {
    "translation": "Nous utilisons spécifiquement un processus agile.",
    "ts": 1770077942
  },
  "auto|So here the entire requirements will be prepared.": {
    "translation": "Donc, ici, toutes les exigences vont être préparées.",
    "ts": 1770077942
  },
  "auto|There is like waterfall model and all.": {
    "translation": "Il y a par exemple le modèle en cascade et autres.",
    "ts": 1770077945
  },
  "auto|Now this person along with the business analyst.": {
    "translation": "Maintenant, cette personne, ainsi que l'analyste commercial.",
    "ts": 1770077945
  },
  "auto|So obviously the person who is experienced in this domain will be the product owner.": {
    "translation": "De toute évidence, la personne ayant une expérience dans ce domaine sera le propriétaire du produit.",
    "ts": 1770077947
  },
  "auto|the whole world itself.": {
    "translation": "le monde entier lui-même.",
    "ts": 1770077947
  },
  "auto|It may be coming from different different departments.": {
    "translation": "Ça peut provenir de différents départements.",
    "ts": 1770077947
  },
  "auto|So here business analyst are the most luckiest people.": {
    "translation": "Alors ici, les analystes d'affaires sont les personnes les plus chanceuses.",
    "ts": 1770077947
  },
  "auto|and they will jot down all the requirements.": {
    "translation": "Et ils noteront tous les détails nécessaires.",
    "ts": 1770077947
  },
  "auto|So uh, they will write down all the requirements.": {
    "translation": "Alors, euh, ils vont noter tous les besoins.",
    "ts": 1770077947
  },
  "auto|will try to divide this entire story in the form of sprints.": {
    "translation": "Essaierons de diviser toute cette histoire sous forme de sprints.",
    "ts": 1770077947
  },
  "auto|each and every sprint they will try to divide this requirements like which all modules needs to be developed": {
    "translation": "À chaque sprint, ils essaieront de diviser ces exigences en déterminant quels modules doivent être développés.",
    "ts": 1770077947
  },
  "auto|It may be coming from the e-commerce department.": {
    "translation": "Cela pourrait provenir du département e-commerce.",
    "ts": 1770077947
  },
  "auto|Now agile process basically means like they are different different process of development.": {
    "translation": "Le processus agile signifie essentiellement qu'il existe différentes méthodes de développement.",
    "ts": 1770077947
  },
  "auto|And they will write down all the requirements like uh, what all stories needs to be completed and they": {
    "translation": "Et ils écriront toutes les exigences, comme euh, quelles histoires doivent être terminées, et ils...",
    "ts": 1770077947
  },
  "auto|foreign countries and also you really get a good amount of chance to interact with them travel, travel": {
    "translation": "Pays étrangers et vous avez vraiment beaucoup d'occasions de les rencontrer, voyager, voyager",
    "ts": 1770077947
  },
  "auto|Okay, so here in a data science project, also we are in most of the companies.": {
    "translation": "D'accord, donc ici, dans un projet de science des données, comme c'est le cas dans la plupart des entreprises.",
    "ts": 1770077947
  },
  "auto|What I feel because if your if your uh uh if your specifically like if your client is in some different": {
    "translation": "Ce que je ressens, c'est que si votre client, euh, si votre client est dans une situation différente,",
    "ts": 1770077947
  },
  "auto|So in most of the data science project, what I have seen in my experience, they usually follow an": {
    "translation": "Dans la plupart des projets de science des données que j'ai pu observer au cours de mon expérience, ils suivent généralement une démarche.",
    "ts": 1770077947
  },
  "auto|agile process where they create sprints like there will be sprint one, there will be sprint two, and": {
    "translation": "Processus agile où ils créent des sprints, comme il y aura le sprint un, il y aura le sprint deux, et",
    "ts": 1770077950
  },
  "auto|Now again, this data analyst and data science team will have a discussion with the domain expertise": {
    "translation": "Maintenant, à nouveau, l'analyste de données et l'équipe de science des données vont avoir une discussion avec l'expertise du domaine.",
    "ts": 1770077950
  },
  "auto|So this person will know that what is that data science project that they really want to implement?": {
    "translation": "Alors, cette personne saura quel est ce projet de science de données qu'ils veulent vraiment mettre en œuvre ?",
    "ts": 1770077952
  },
  "auto|And here with respect to this particular use case, we are going to solve this data science project.": {
    "translation": "Et ici, en ce qui concerne ce cas d'utilisation spécifique, nous allons résoudre ce projet de science des données.",
    "ts": 1770077952
  },
  "auto|or product owner and they will try to find out like what all data, what all data will be required in": {
    "translation": "ou le propriétaire du produit et ils vont essayer de découvrir, par exemple, quelles données, quelles données seront nécessaires dans \n\n Réécriture pour un flow plus naturel en doublage : \nou le propriétaire du produit et ils vont essayer de déterminer quelles données seront nécessaires dans",
    "ts": 1770077952
  },
  "auto|So this business analyst, along with the domain expert or product owner, they will have a lot of discussion": {
    "translation": "Ce business analyst, en collaboration avec l'expert du domaine ou le propriétaire du produit, ils auront beaucoup de discussions.",
    "ts": 1770077952
  },
  "auto|They follow an agile process.": {
    "translation": "Ils suivent un processus agile.",
    "ts": 1770077952
  },
  "auto|in sprint one, which all module needs to be developed in sprint two.": {
    "translation": "Dans la première phase, tous les modules doivent être développés dans la deuxième phase.",
    "ts": 1770077952
  },
  "auto|So once that requirements is basically written down okay, then all these requirements are sent to the": {
    "translation": "Une fois que les exigences sont essentiellement écrites, alors toutes ces exigences sont envoyées à",
    "ts": 1770077952
  },
  "auto|data analyst or data scientist team specifically in a data science project.": {
    "translation": "Équipe d'analystes de données ou de data scientists, spécifiquement dans un projet de science de données.",
    "ts": 1770077954
  },
  "auto|having the data within the company.": {
    "translation": "En ayant les données au sein de l'entreprise.",
    "ts": 1770077954
  },
  "auto|So those kind of data, they will first of all identify.": {
    "translation": "Ce type de données sera donc identifié en premier lieu.",
    "ts": 1770077954
  },
  "auto|Once they identify the data source then here my big data engineering team will come into picture now,": {
    "translation": "Une fois qu'ils ont identifié la source de données, mon équipe d'ingénierie de données volumineuses intervient maintenant.",
    "ts": 1770077957
  },
  "auto|order to solve this particular project.": {
    "translation": "afin de résoudre ce projet en particulier.",
    "ts": 1770077957
  },
  "auto|Solve this particular problem.": {
    "translation": "Résolvez ce problème particulier.",
    "ts": 1770077957
  },
  "auto|They will be specifically identifying the data.": {
    "translation": "Ils identifieront spécifiquement les données.",
    "ts": 1770077957
  },
  "auto|It may be present in a third party or cloud API.": {
    "translation": "Il peut être présent dans une API tierce ou dans le cloud.",
    "ts": 1770077957
  },
  "auto|It may be an IoT data also.": {
    "translation": "Cela peut être également des données IoT.",
    "ts": 1770077957
  },
  "auto|Now data may be present in the internal database.": {
    "translation": "Les données peuvent maintenant être présentes dans la base de données interne.",
    "ts": 1770077957
  },
  "auto|So they will be identifying the data right.": {
    "translation": "Ils identifieront donc les données correctement.",
    "ts": 1770077957
  },
  "auto|It may also be an API data.": {
    "translation": "Cela peut également être des données d'API.",
    "ts": 1770077957
  },
  "auto|source of the data okay.": {
    "translation": "Source des données, d'accord.",
    "ts": 1770077957
  },
  "auto|Now when I say identifying the data that basically means, uh, you know, they'll try to identify the": {
    "translation": "Identifier les données, c'est à dire, euh, vous savez, ils essaieront d'identifier les",
    "ts": 1770077957
  },
  "auto|lot of IoT devices and we used to capture those specific data.": {
    "translation": "Beaucoup d'appareils IoT et nous capturions précisément ces données.",
    "ts": 1770077957
  },
  "auto|So we need to identify the data and to identify the data.": {
    "translation": "Nous devons donc identifier les données et identifier les données.",
    "ts": 1770077957
  },
  "auto|Again, we will be requiring the help of a product owner or domain expertise because they may also be": {
    "translation": "Nous aurons besoin à nouveau de l'aide d'un propriétaire de produit ou d'une expertise en domaine car ils peuvent également",
    "ts": 1770077957
  },
  "auto|Uh, in in my previous companies where I was working with electronics goods, you know, there we had": {
    "translation": "Eh bien, dans mes précédentes sociétés où je travaillais avec des produits électroniques, vous savez, là-bas nous avions",
    "ts": 1770077957
  },
  "auto|They may be dependent on some third parties and all.": {
    "translation": "Ils peuvent dépendre de certaines tierces parties, et de tout le reste.",
    "ts": 1770077959
  },
  "auto|Now, one of the most common data pipeline that you will be seeing in the industries that will be done": {
    "translation": "Maintenant, l'un des pipelines de données les plus courants que vous verrez dans l'industrie sera réalisé.",
    "ts": 1770077959
  },
  "auto|Now this ETL pipeline is nothing but extract, transform and load okay.": {
    "translation": "Maintenant, ce pipeline ETL n'est rien d'autre qu'extraire, transformer et charger, d'accord.",
    "ts": 1770077962
  },
  "auto|because this big data engineering team will now create a data pipeline.": {
    "translation": "Parce que cette équipe d'ingénieurs de données massives va maintenant créer un pipeline de données.",
    "ts": 1770077962
  },
  "auto|Data pipeline.": {
    "translation": "Data pipeline.",
    "ts": 1770077962
  },
  "auto|form of data pipeline.": {
    "translation": "forme de pipeline de données.",
    "ts": 1770077962
  },
  "auto|Now, this data pipeline is created in such a way that, first of all, whichever source we are identifying,": {
    "translation": "Maintenant, ce pipeline de données est créé de telle sorte que, d'abord, quelle que soit la source que nous identifions,",
    "ts": 1770077962
  },
  "auto|right, we will capture all this particular source, and then we will combine all those data in the": {
    "translation": "D'accord, nous capturerons cette source particulière, et puis nous combinerons tous ces données dans.",
    "ts": 1770077962
  },
  "auto|Like how does a big data engineering team work?": {
    "translation": "Comment fonctionne une équipe d'ingénierie de données volumineuses ?",
    "ts": 1770077964
  },
  "auto|Okay, ETL pipeline.": {
    "translation": "D'accord, pipeline ETL.",
    "ts": 1770077964
  },
  "auto|by the big data engineering team, it is nothing but the ETL pipeline.": {
    "translation": "par l'équipe d'ingénierie des données massives, c'est tout simplement la pipeline ETL.",
    "ts": 1770077965
  },
  "auto|So I will be focusing on that right.": {
    "translation": "Je vais donc me concentrer sur cela.",
    "ts": 1770077967
  },
  "auto|We basically extract from multiple data sources.": {
    "translation": "Nous extrayons essentiellement les données de plusieurs sources.",
    "ts": 1770077967
  },
  "auto|source like MongoDB.": {
    "translation": "MongoDB.",
    "ts": 1770077967
  },
  "auto|And we will be creating this ETL pipeline.": {
    "translation": "Nous allons créer ce pipeline ETL.",
    "ts": 1770077967
  },
  "auto|We do some kind of transformation, and then we finally load that entire combined data into some data": {
    "translation": "Nous réalisons une sorte de transformation, et puis nous chargeons finalement tout ce données combinées dans certaines données.",
    "ts": 1770077967
  },
  "auto|Also I have taken a couple of projects and I will show you how an ETL pipeline will be used.": {
    "translation": "J'ai également pris un couple de projets et je vais vous montrer comment un pipeline ETL sera utilisé.",
    "ts": 1770077967
  },
  "auto|everything.": {
    "translation": "tout.",
    "ts": 1770077967
  },
  "auto|It can be PostgreSQL and all.": {
    "translation": "C'est tout PostgreSQL, et ça marche.",
    "ts": 1770077967
  },
  "auto|Because if let's say that my data is basically coming from third party API every day, I need to probably": {
    "translation": "Si mes données proviennent en fait d'une API tierce chaque jour, je dois probablement",
    "ts": 1770077967
  },
  "auto|because this actually helps you to schedule the right schedule.": {
    "translation": "Cela vous aide en réalité à établir le bon emploi du temps.",
    "ts": 1770077967
  },
  "auto|And this is one of the amazing MLOps tool, uh, which is basically used to create this ETL pipeline,": {
    "translation": "Et c'est l'un de ces outils MLOps incroyables, uh, qui est principalement utilisé pour créer cette pipeline ETL.",
    "ts": 1770077967
  },
  "auto|get that particular data so I can actually schedule this with the help of Apache Airflow.": {
    "translation": "Récupérez cette donnée spécifique afin que je puisse réellement planifier cela avec l'aide d'Apache Airflow.",
    "ts": 1770077967
  },
  "auto|So here in this MLOps project, you know, my main aim was to give you the, uh, the crux of each and": {
    "translation": "Voici la traduction :\n\nAlors, ici dans ce projet MLOps, vous savez, mon principal objectif était de vous donner, euh, le cœur de chaque et",
    "ts": 1770077967
  },
  "auto|So here we will be covering this entire ETL pipeline.": {
    "translation": "Nous allons ici aborder l'ensemble de cette pipeline ETL.",
    "ts": 1770077967
  },
  "auto|And we will specifically use Apache Airflow over here.": {
    "translation": "Nous utiliserons spécifiquement Apache Airflow ici.",
    "ts": 1770077967
  },
  "auto|One of the roles and responsibilities over here are like product owner.": {
    "translation": "L'un des rôles et des responsabilités ici est similaire à celui de propriétaire de produit.",
    "ts": 1770077969
  },
  "auto|Because here we'll focus on deployment also how to deploy this entire ETL pipeline.": {
    "translation": "Car ici, nous allons nous concentrer sur le déploiement, ainsi que sur la façon de déployer toute la chaîne de traitement ETL.",
    "ts": 1770077969
  },
  "auto|So in this particular uh like in one of the modules right.": {
    "translation": "Alors dans ce cas précis, euh, comme dans l'un des modules, justement.",
    "ts": 1770077971
  },
  "auto|But here from this, identifying the data source and all, we will try to go ahead and implement it.": {
    "translation": "Mais à partir de ceci, en identifiant la source de données et tout, nous allons essayer de procéder et de l'implémenter.",
    "ts": 1770077971
  },
  "auto|We will be discussing about data pipeline.": {
    "translation": "Nous allons discuter du pipeline de données.",
    "ts": 1770077972
  },
  "auto|We will be discussing about ETL pipeline.": {
    "translation": "Nous allons discuter de l'ETL pipeline.",
    "ts": 1770077972
  },
  "auto|We'll also be doing the deployment.": {
    "translation": "Nous allons également procéder à la mise en œuvre.",
    "ts": 1770077972
  },
  "auto|So uh that is what a big data engineer team does.": {
    "translation": "Alors euh, c'est ce que fait une équipe d'ingénieurs en données massives.",
    "ts": 1770077974
  },
  "auto|Now the next thing will be that whatever data has been collected in the data source, right?": {
    "translation": "Maintenant, la prochaine étape sera que toutes les données collectées dans la source de données, c'est exact ?",
    "ts": 1770077974
  },
  "auto|They actually create amazing data pipelines wherein they integrate with multiple data sources and then": {
    "translation": "Ils créent en réalité des pipelines de données incroyables où ils intègrent plusieurs sources de données et puis",
    "ts": 1770077974
  },
  "auto|So let's say over here I will just try to connect this okay.": {
    "translation": "Alors disons que je vais essayer de connecter ceci, d'accord.",
    "ts": 1770077976
  },
  "auto|So once this entire data is basically loaded in the MongoDB, this will keep on getting updated in a": {
    "translation": "Une fois que toutes ces données sont chargées dans MongoDB, elles continueront de se mettre à jour en temps réel.",
    "ts": 1770077976
  },
  "auto|Once that data source is, let's say the data source over here is used as MongoDB, right?": {
    "translation": "Une fois que cette source de données est utilisée, disons que la source de données ici est MongoDB, c'est ça ?",
    "ts": 1770077977
  },
  "auto|And for this we'll be using AWS cloud and all.": {
    "translation": "Et pour cela, nous utiliserons le cloud AWS et tout le reste.",
    "ts": 1770077979
  },
  "auto|Whenever we talk about life cycle or data science project, the first step, which I probably missed": {
    "translation": "Lorsqu'on parle du cycle de vie ou d'un projet de science des données, la première étape, que j'ai probablement manquée",
    "ts": 1770077979
  },
  "auto|Now, once we go to the life cycle of a data science project.": {
    "translation": "Maintenant, une fois que nous abordons le cycle de vie d'un projet de science des données.",
    "ts": 1770077979
  },
  "auto|try to combine the data and they load it into a specific data source.": {
    "translation": "Essayez de combiner les données et chargez-les dans une source de données spécifique.",
    "ts": 1770077979
  },
  "auto|Now from this particular uh pipeline we are storing it in the MongoDB.": {
    "translation": "Maintenant, avec ce pipeline en particulier, nous le stockons dans MongoDB.",
    "ts": 1770077981
  },
  "auto|daily basis or in a weekly basis.": {
    "translation": "à un rythme quotidien ou en semaine.",
    "ts": 1770077982
  },
  "auto|I will just try to go ahead and connect this.": {
    "translation": "Je vais essayer d'aller de l'avant et de connecter cela.",
    "ts": 1770077982
  },
  "auto|It can be Postgres, it can be MongoDB.": {
    "translation": "Ça peut être Postgres, ça peut être MongoDB.",
    "ts": 1770077984
  },
  "auto|over here, to write it down, it is nothing but data ingestion.": {
    "translation": "Ici, pour l'écrire, il s'agit simplement d'ingestion de données.",
    "ts": 1770077984
  },
  "auto|That depends on the data.": {
    "translation": "Ça dépend des données.",
    "ts": 1770077984
  },
  "auto|In one of the example I have used MongoDB.": {
    "translation": "J'ai utilisé MongoDB dans un exemple.",
    "ts": 1770077984
  },
  "auto|kind of things.": {
    "translation": "Ce genre de choses.",
    "ts": 1770077984
  },
  "auto|They use tools like JIRA confluence to write down all the requirements.": {
    "translation": "Ils utilisent des outils comme JIRA confluence pour écrire toutes les exigences.",
    "ts": 1770077984
  },
  "auto|And this entire MLOps course I will cover each and every thing with respect to this, right.": {
    "translation": "Et dans ce cours complet sur MLOps, je vais couvrir chaque aspect en détail, d'accord.",
    "ts": 1770077984
  },
  "auto|are there, right?": {
    "translation": "ils sont là, n'est-ce pas ?",
    "ts": 1770077984
  },
  "auto|Now, just by understanding this, you are able to understand that how many different roles and responsibilities": {
    "translation": "Maintenant, simplement en comprenant cela, vous êtes capable de comprendre que combien de rôles et de responsabilités différents",
    "ts": 1770077984
  },
  "auto|That is probably coming from the third party APIs or any other data source.": {
    "translation": "Cela provient probablement des APIs tierces ou d'une autre source de données.",
    "ts": 1770077984
  },
  "auto|Now once this is done, then our life cycle of a data science project comes.": {
    "translation": "Maintenant que c'est fait, voici le cycle de vie d'un projet de science des données.",
    "ts": 1770077984
  },
  "auto|data engineering team, right.": {
    "translation": "Équipe d'ingénierie des données, oui.",
    "ts": 1770077984
  },
  "auto|Then you have business analyst, then you have data scientist, then data analyst, then you have big": {
    "translation": "Ensuite, vous avez l'analyste commercial, puis le scientifique des données, puis l'analyste de données, et puis vous avez les mégas...",
    "ts": 1770077984
  },
  "auto|Obviously, I will not be covering product owner or business analyst because that is more of a documentation": {
    "translation": "Évidemment, je ne parlerai pas du propriétaire de produit ou de l'analyste commercial, car cela concerne davantage la documentation.",
    "ts": 1770077984
  },
  "auto|Now from the MongoDB, our life cycle of a data science project starts okay.": {
    "translation": "Maintenant, à partir de MongoDB, notre cycle de vie d'un projet de science des données commence, d'accord.",
    "ts": 1770077986
  },
  "auto|So I would like to consider as this as my first step okay.": {
    "translation": "Je voudrais donc considérer cela comme mon premier pas, d'accord.",
    "ts": 1770077986
  },
  "auto|Let's say this is my data source.": {
    "translation": "Disons que c'est ma source de données.",
    "ts": 1770077987
  },
  "auto|Uh, one of the data source that I have also used is like something called as PostgreSQL.": {
    "translation": "Euh, l'une des sources de données que j'ai également utilisée est quelque chose qu'on appelle PostgreSQL.",
    "ts": 1770077989
  },
  "auto|So this is the step before feature engineering.": {
    "translation": "Alors c'est l'étape qui précède l'ingénierie des fonctionnalités.",
    "ts": 1770077989
  },
  "auto|So here it is nothing but data Ingestion.": {
    "translation": "Voilà, il ne s'agit que d'ingestion de données.",
    "ts": 1770077989
  },
  "auto|Let me just draw it on the top so that it will be easy for you to understand.": {
    "translation": "Laisse-moi juste le dessiner en haut pour que ce soit plus facile à comprendre pour toi.",
    "ts": 1770077989
  },
  "auto|Now again, here we are.": {
    "translation": "Maintenant encore, voilà où nous sommes.",
    "ts": 1770077989
  },
  "auto|DVC basically means data versioning control.": {
    "translation": "DVC signifie essentiellement contrôle de versionnage des données.",
    "ts": 1770077991
  },
  "auto|Then I go to this my next step.": {
    "translation": "Ensuite, je passe à l'étape suivante.",
    "ts": 1770077991
  },
  "auto|Or let me do one thing.": {
    "translation": "Retourne UNIQUEMENT la traduction. \n\nAlors laissez-moi faire une chose.",
    "ts": 1770077992
  },
  "auto|So here you will be able to see that I have used DVC.": {
    "translation": "Voici, vous allez voir que j'ai utilisé DVC.",
    "ts": 1770077994
  },
  "auto|model, right, it is important that we have a proper versioning of the data because tomorrow the data": {
    "translation": "Modèle, c'est exact, il est crucial que nous ayons une version correcte des données parce que demain, les données",
    "ts": 1770077994
  },
  "auto|Uh our main aim is to read the data from data source okay.": {
    "translation": "Notre objectif principal est de lire les données provenant de la source de données, d'accord.",
    "ts": 1770077994
  },
  "auto|So let's consider MongoDB MongoDB and this MongoDB will also be hosted in the cloud okay.": {
    "translation": "Alors considérons MongoDB. Ce MongoDB sera également hébergé dans le cloud, OK.",
    "ts": 1770077995
  },
  "auto|engineering.": {
    "translation": "Ingénierie.",
    "ts": 1770077996
  },
  "auto|may change.": {
    "translation": "Peut changer.",
    "ts": 1770077996
  },
  "auto|Data ingestion okay.": {
    "translation": "L'ingestion de données est validée.",
    "ts": 1770077996
  },
  "auto|Because data versioning is also important because with respect to every training that we do for our": {
    "translation": "Parce que la gestion des versions de données est également importante, notamment pour chaque formation que nous réalisons pour nos",
    "ts": 1770077999
  },
  "auto|Otherwise this course will go on very long.": {
    "translation": "Sinon, ce cours va s'éterniser.",
    "ts": 1770077999
  },
  "auto|Now what is the work in data ingestion here.": {
    "translation": "Maintenant, qu'est-ce que le travail dans l'ingestion de données ici.",
    "ts": 1770077999
  },
  "auto|So here is my first step.": {
    "translation": "Voici donc mon premier pas.",
    "ts": 1770077999
  },
  "auto|In the data ingestion.": {
    "translation": "Dans l'ingestion des données.",
    "ts": 1770077999
  },
  "auto|And uh while we are probably, uh reading it, there will be separate MLOps tools that will be required.": {
    "translation": "Et euh, pendant que nous sommes probablement en train de le lire, il y aura des outils MLOps distincts qui seront nécessaires.",
    "ts": 1770077999
  },
  "auto|How to read the data from MongoDB It can also be how to read data from Postgres.": {
    "translation": "Comment lire les données de MongoDB. Cela peut également être comment lire les données de Postgres.",
    "ts": 1770077999
  },
  "auto|One of the important MLOps tools that will be used over here is something called as DVC, DVC.": {
    "translation": "L'un des outils MLOps importants qui sera utilisé ici est quelque chose qu'on appelle DVC, DVC.",
    "ts": 1770077999
  },
  "auto|So all these kind of examples, we will try to cover it up.": {
    "translation": "Donc tous ces genres d'exemples, nous allons essayer de les couvrir.",
    "ts": 1770077999
  },
  "auto|So whenever I talk about data ingestion I will be showing you how to read the data from cloud.": {
    "translation": "Donc chaque fois que je parlerai d'ingestion de données, je vous montrerai comment lire les données depuis le cloud.",
    "ts": 1770077999
  },
  "auto|Then we go to feature engineering feature selection and all.": {
    "translation": "Ensuite, nous passons à l'ingénierie des fonctionnalités, la sélection des fonctionnalités, et tout ça.",
    "ts": 1770078000
  },
  "auto|Let's say how to read the data from S3 bucket or AWS S3 bucket.": {
    "translation": "Disons comment lire les données depuis un compartiment S3 ou un compartiment AWS S3.",
    "ts": 1770078000
  },
  "auto|Okay, so here my first step is nothing but data ingestion.": {
    "translation": "D'accord, donc ici, ma première étape n'est rien d'autre que l'ingestion de données.",
    "ts": 1770078000
  },
  "auto|So here, uh, if I talk about DVC, DVC is one MLOps tools, which I'm actually going to use over here": {
    "translation": "Alors ici, euh, si je parle de DVC, DVC est un outil MLOps que j'utiliserai effectivement ici",
    "ts": 1770078001
  },
  "auto|So we'll be talking about like why DVC will be important over here.": {
    "translation": "On parlera donc de pourquoi DVC sera important ici.",
    "ts": 1770078001
  },
  "auto|But some basic feature engineering so that I show you in a specific end to end project complete end": {
    "translation": "Mais quelques ingénieries de base pour que je vous montre dans un projet spécifique de bout en bout complet",
    "ts": 1770078001
  },
  "auto|But, uh, if you probably see some other courses of mine like machine learning and all that, I have": {
    "translation": "Mais, euh, si vous regardez probablement certains de mes autres cours comme l'apprentissage automatique et tout ça, j'ai",
    "ts": 1770078003
  },
  "auto|in big data engineering team.": {
    "translation": "dans l'équipe d'ingénierie de données massives.",
    "ts": 1770078004
  },
  "auto|create the entire ETL pipeline.": {
    "translation": "Créez l'ensemble du pipeline ETL.",
    "ts": 1770078004
  },
  "auto|It may change the entire data format itself which is coming from the data source.": {
    "translation": "Cela peut modifier l'ensemble du format des données lui-même, qui provient de la source de données.",
    "ts": 1770078004
  },
  "auto|It may also add some more features inside it.": {
    "translation": "Cela pourrait aussi ajouter des fonctionnalités supplémentaires à l'intérieur.",
    "ts": 1770078006
  },
  "auto|I've also used Randomizedsearchcv in one example.": {
    "translation": "J'ai également utilisé Randomizedsearchcv dans un exemple.",
    "ts": 1770078006
  },
  "auto|So you will be able to see all this kind of hyperparameter tuning when I am doing it.": {
    "translation": "Vous pourrez donc voir tout ce type de réglage d'hyperparamètres lorsque je le ferai.",
    "ts": 1770078006
  },
  "auto|focused more on feature engineering and feature selection.": {
    "translation": "Se concentre davantage sur l'ingénierie de fonctionnalités et la sélection de fonctionnalités.",
    "ts": 1770078006
  },
  "auto|Then after this, we go to the feature engineering.": {
    "translation": "Ensuite, on passe à l'ingénierie des caractéristiques.",
    "ts": 1770078006
  },
  "auto|While we are creating the data pipeline, we will be specifically using airflow, you know, to probably": {
    "translation": "Pendant que nous créons le pipeline de données, nous utiliserons spécifiquement Airflow, vous savez, pour probablement",
    "ts": 1770078007
  },
  "auto|Now this experiment tracking how it is basically happening.": {
    "translation": "Maintenant, cette expérience suit comment cela se produit basically. \n\n Non  : \nMaintenant, cette expérience suit comment cela se produit basically.\n\n Plutôt : \nMaintenant, cette expérience suit comment tout cela se produit.",
    "ts": 1770078008
  },
  "auto|So this is one of the module like feature transformation where we specifically do EDA handling missing": {
    "translation": "Alors ceci est l'un des modules, comme la transformation de fonctionnalités, où nous effectuons spécifiquement le traitement des données manquantes, l'EDA.",
    "ts": 1770078008
  },
  "auto|to end project.": {
    "translation": "Terminer le projet.",
    "ts": 1770078009
  },
  "auto|Again, in this course we have not focused more on feature engineering or different types of feature": {
    "translation": "Encore une fois, dans ce cours, nous n'avons pas mis l'accent sur l'ingénierie des fonctionnalités ou sur les différents types de fonctionnalités.",
    "ts": 1770078010
  },
  "auto|parameter.": {
    "translation": "Paramètre.",
    "ts": 1770078010
  },
  "auto|And the reason why I'm doing this, because after I perform the hyperparameter tuning, I have to log": {
    "translation": "Et la raison pour laquelle je fais cela, c'est que après avoir effectué le réglage des hyperparamètres, je dois enregistrer",
    "ts": 1770078011
  },
  "auto|One example I've shown with the help of Hyperopt.": {
    "translation": "Un exemple que j'ai montré avec l'aide de Hyperopt.",
    "ts": 1770078012
  },
  "auto|Now this is the most important step.": {
    "translation": "Maintenant, c'est le pas le plus important.",
    "ts": 1770078012
  },
  "auto|Then, uh, we will be understanding about dockers, how to dockerize your container and all.": {
    "translation": "Ensuite, euh, nous allons comprendre les dockers, comment dockeriser votre conteneur et tout ça.",
    "ts": 1770078013
  },
  "auto|So experiment tracking will happen over here.": {
    "translation": "Le suivi des expériences aura donc lieu ici.",
    "ts": 1770078013
  },
  "auto|CV.": {
    "translation": "CV.",
    "ts": 1770078014
  },
  "auto|And here we are specifically going to use MLflow.": {
    "translation": "Et nous allons utiliser spécifiquement MLflow ici.",
    "ts": 1770078016
  },
  "auto|Then we have this model deployment next stage.": {
    "translation": "Nous avons ensuite cette étape suivante de déploiement du modèle.",
    "ts": 1770078016
  },
  "auto|We are going to use a remote repository called a DAGs hub.": {
    "translation": "Nous allons utiliser un dépôt distant appelé DAGs hub.",
    "ts": 1770078016
  },
  "auto|Now for model creation hyperparameter tuning I will be using multiple models.": {
    "translation": "Maintenant, pour la création de modèles et le réglage des hyperparamètres, j'utiliserai plusieurs modèles.",
    "ts": 1770078016
  },
  "auto|Experiment tracking will happen over here.": {
    "translation": "Suivi d'expérience se déroulera ici.",
    "ts": 1770078018
  },
  "auto|So here specifically we will be using MLflow for experiment tracking.": {
    "translation": "Ici, nous allons spécifiquement utiliser MLflow pour le suivi des expériences.",
    "ts": 1770078018
  },
  "auto|Uh, when I talk about model deployment, um, I'll be using clouds like AWS and Azure.": {
    "translation": "Euh, quand je parle du déploiement de modèles, euh, j'utiliserai des clouds comme AWS et Azure.",
    "ts": 1770078018
  },
  "auto|And then you can also go ahead and try out.": {
    "translation": "Et puis vous pouvez aussi essayer.",
    "ts": 1770078018
  },
  "auto|One example I've shown with Gridsearchcv.": {
    "translation": "Un exemple que j'ai montré avec Gridsearchcv.",
    "ts": 1770078018
  },
  "auto|values, handling outliers and all.": {
    "translation": "valeurs, gestion des valeurs aberrantes et tout.",
    "ts": 1770078018
  },
  "auto|That is model creation and hyperparameter tuning.": {
    "translation": "C'est la création de modèles et le réglage des hyperparamètres.",
    "ts": 1770078018
  },
  "auto|Then we have feature selection where we probably select the best features that is required for the model.": {
    "translation": "Ensuite, nous avons la sélection des caractéristiques où nous sélectionnons probablement les meilleures caractéristiques nécessaires pour le modèle.",
    "ts": 1770078018
  },
  "auto|We will try to perform different different hyperparameter tuning will try to select the different parameters.": {
    "translation": "Nous allons essayer d'effectuer différents réglages d'hyperparamètres, nous allons essayer de sélectionner les différents paramètres.",
    "ts": 1770078018
  },
  "auto|each and every metrics.": {
    "translation": "toutes les mesures.",
    "ts": 1770078020
  },
  "auto|And here I will be using something called as MLflow, because here we are going to probably track experiments.": {
    "translation": "Et ici, je vais utiliser quelque chose qui s'appelle MLflow, parce que nous allons probablement suivre les expériences.",
    "ts": 1770078020
  },
  "auto|Not only that will deploy this MLflow in remote repository or in AWS.": {
    "translation": "Cela déployera également MLflow dans un référentiel distant ou dans AWS.",
    "ts": 1770078021
  },
  "auto|So here, uh, there is a detailed module about understanding about Dockers, how you can work with": {
    "translation": "Alors, ici, euh, il y a un module détaillé sur la compréhension de Docker, sur la façon de travailler avec",
    "ts": 1770078021
  },
  "auto|In one of the course, I have, uh, in one of the module I have implemented both with AWS Azure.": {
    "translation": "Dans l'un des cours, j'ai, euh, dans l'un des modules, j'ai mis en œuvre les deux avec AWS et Azure.",
    "ts": 1770078021
  },
  "auto|And here you can see that MLflow is also one of the MLOps tools that we will be using over here.": {
    "translation": "Voici la traduction :\n\nEt voilà, on peut voir que MLflow est également l'un des outils MLOps que nous utiliserons ici.",
    "ts": 1770078023
  },
  "auto|build, deploy, create endpoints directly inside your AWS infrastructure itself.": {
    "translation": "Créez, déployez et configurez des points de terminaison directement au sein de votre infrastructure AWS elle-même.",
    "ts": 1770078023
  },
  "auto|In other I have specifically gone with AWS.": {
    "translation": "Dans d'autres cas, j'ai spécifiquement opté pour AWS.",
    "ts": 1770078024
  },
  "auto|We will be using that also.": {
    "translation": "Nous allons aussi l'utiliser.",
    "ts": 1770078025
  },
  "auto|So if I talk about DAGs hub this is another remote repository.": {
    "translation": "Donc si je parle du hub DAGs, c'est un autre référentiel distant.",
    "ts": 1770078025
  },
  "auto|my complete experiment tracking where we will be logging metrics, where we'll be logging each and every": {
    "translation": "mon expérience complète de suivi où nous allons enregistrer des données, où nous allons enregistrer chaque et chaque",
    "ts": 1770078025
  },
  "auto|or creating a data science project will be very easy.": {
    "translation": "ou créer un projet de science des données sera très facile.",
    "ts": 1770078025
  },
  "auto|Uh, so this is the overall thing because based on this particular visualization that we are created": {
    "translation": "Eh bien, voilà le tableau d'ensemble, car sur la base de cette visualisation que nous avons créée",
    "ts": 1770078026
  },
  "auto|You know, um, I have also used, uh, AWS SageMaker.": {
    "translation": "Je connais AWS SageMaker, en fait.",
    "ts": 1770078026
  },
  "auto|Uh, like you can also use a Jupyter notebook and probably create each and every thing.": {
    "translation": "Euh, vous pouvez aussi utiliser un Jupyter notebook et probablement créer chaque chose.",
    "ts": 1770078028
  },
  "auto|Uh, everything like Docker compose, everything is basically explained in that particular module.": {
    "translation": "Euh, tout comme Docker compose, tout est expliqué en détail dans ce module particulier.",
    "ts": 1770078028
  },
  "auto|So that project is also probably taken over here.": {
    "translation": "Donc ce projet a probablement été repris ici.",
    "ts": 1770078028
  },
  "auto|based on that.": {
    "translation": "Sur la base de cela.",
    "ts": 1770078028
  },
  "auto|But my main aim is to bring modularity.": {
    "translation": "Mais mon objectif principal est d'apporter la modularité.",
    "ts": 1770078030
  },
  "auto|We'll probably visualize things.": {
    "translation": "Nous allons probablement visualiser les choses.",
    "ts": 1770078031
  },
  "auto|Then coming to the last stage, which is nothing but model monitoring.": {
    "translation": "La dernière étape, qui ne fait que surveiller le modèle.",
    "ts": 1770078031
  },
  "auto|how the visualization is basically created, how each and every graph is created, and all that we'll": {
    "translation": "Comment la visualisation est créée, comment chaque graphique est réalisé, et tout ce que nous allons...",
    "ts": 1770078031
  },
  "auto|Dockers and all.": {
    "translation": "Dockers et tout le reste.",
    "ts": 1770078032
  },
  "auto|So two clouds will be more than sufficient in this particular course.": {
    "translation": "Deux nuages suffiront largement dans ce cas précis.",
    "ts": 1770078032
  },
  "auto|So here we will be also showing you that how the GitHub actions can be created.": {
    "translation": "Nous allons donc également vous montrer comment créer des actions GitHub.",
    "ts": 1770078032
  },
  "auto|So AWS SageMaker actually helps you to create the entire entire end to end, uh, you'll be able to": {
    "translation": "Donc AWS SageMaker vous aide en fait à créer tout le processus de bout en bout, euh, vous serez capable de",
    "ts": 1770078033
  },
  "auto|Uh, over here will we will try to visualize the, uh, model outputs or we'll try to write some rules": {
    "translation": "Nous allons essayer de visualiser les sorties du modèle, ou nous allons essayer d'écrire quelques règles.",
    "ts": 1770078033
  },
  "auto|We specifically create we will be using YAML, YAML files.": {
    "translation": "Nous créons spécifiquement, nous allons utiliser des fichiers YAML.",
    "ts": 1770078033
  },
  "auto|Now model monitoring.": {
    "translation": "Maintenant, la surveillance de modèle.",
    "ts": 1770078035
  },
  "auto|So I will be using something called as Grafana.": {
    "translation": "Donc je vais utiliser quelque chose qui s'appelle Grafana.",
    "ts": 1770078035
  },
  "auto|And for this also we are going to use an MLOps tool which is called as Grafana.": {
    "translation": "Et pour cela également, nous allons utiliser un outil MLOps qui s'appelle Grafana.",
    "ts": 1770078035
  },
  "auto|You know what are workflows.": {
    "translation": "Vous savez ce que sont les workflows.",
    "ts": 1770078035
  },
  "auto|Modularity in the.": {
    "translation": "Modularité dans le.",
    "ts": 1770078035
  },
  "auto|be discussing over here.": {
    "translation": "On en parle ici.",
    "ts": 1770078036
  },
  "auto|And I'll try to show you through the basic example like how a rules is basically set in the Grafana,": {
    "translation": "Et je vais essayer de vous montrer à travers un exemple de base comme comment une règle est principalement définie dans Grafana.",
    "ts": 1770078036
  },
  "auto|So Grafana is basically used.": {
    "translation": "Donc Grafana est essentiellement utilisé.",
    "ts": 1770078037
  },
  "auto|And if I just show you the logo over here.": {
    "translation": "Et si je vous montre juste le logo ici.",
    "ts": 1770078037
  },
  "auto|in the Grafana.": {
    "translation": "dans Grafana.",
    "ts": 1770078037
  },
  "auto|So this specifically manages the airflow.": {
    "translation": "Ceci gère spécifiquement le flux d'air.",
    "ts": 1770078037
  },
  "auto|How do you probably go ahead and create different different environments like you at or this that you": {
    "translation": "Comment allez-vous probablement créer différents environnements, comme celui-ci ou celui-là ?",
    "ts": 1770078038
  },
  "auto|Right?": {
    "translation": "D'accord ?",
    "ts": 1770078038
  },
  "auto|And along with this it provides a cloud platform to properly deploy the airflow.": {
    "translation": "Et en outre, il fournit une plate-forme cloud pour déployer correctement Airflow.",
    "ts": 1770078039
  },
  "auto|So DVC.": {
    "translation": "Alors DVC.",
    "ts": 1770078040
  },
  "auto|We will be discussing about that and whenever we do the deployment right we do the deployment.": {
    "translation": "Nous discuterons de cela et chaque fois que nous faisons une mise en œuvre correcte, nous faisons une mise en œuvre.",
    "ts": 1770078040
  },
  "auto|So we'll be talking about astronomer then for my code tracking I will be using git right.": {
    "translation": "On va donc parler d'astronomie. Pour suivre mon code, j'utiliserai git, c'est tout.",
    "ts": 1770078042
  },
  "auto|Now many people will be asking, now let me just go through the list of all the MLOps tools we are using.": {
    "translation": "Maintenant, beaucoup de gens se demanderont, laissez-moi simplement parcourir la liste de tous les outils MLOps que nous utilisons.",
    "ts": 1770078042
  },
  "auto|So overall, uh, in this entire, uh, entire lifecycle of a data science project, creating life cycle": {
    "translation": "Donc globalement, euh, dans ce cycle de vie complet, euh, d'un projet de science des données, créer un cycle de vie",
    "ts": 1770078042
  },
  "auto|know it is up to you, right.": {
    "translation": "C'est à toi de décider, c'est ça.",
    "ts": 1770078043
  },
  "auto|how industries in industry.": {
    "translation": "comment les industries dans l'industrie.",
    "ts": 1770078044
  },
  "auto|We will try to write a modular code how an end to end project is basically created completely modular": {
    "translation": "Nous allons essayer d'écrire un code modulaire comme un projet complet est créé de manière totalement modulaire.",
    "ts": 1770078044
  },
  "auto|Uh, I'm considering this that, you know, at least one NoSQL or one SQL database.": {
    "translation": "Euh, je pense que l'on peut envisager d'utiliser au moins une base de données NoSQL ou une base de données SQL.",
    "ts": 1770078044
  },
  "auto|all the tools are open source.": {
    "translation": "Tous les outils sont en open source.",
    "ts": 1770078044
  },
  "auto|Along with this are how how a complete pipeline is basically created.": {
    "translation": "Et voici comment un pipeline complet est créé de A à Z.",
    "ts": 1770078045
  },
  "auto|Over here we will be using something called as GitHub action.": {
    "translation": "Ici, nous allons utiliser quelque chose appelé GitHub action.",
    "ts": 1770078045
  },
  "auto|Because I'll directly be writing the query and all.": {
    "translation": "Parce que j'écrirai directement la requête et tout.",
    "ts": 1770078047
  },
  "auto|We'll also be using AWS SageMaker.": {
    "translation": "Nous allons également utiliser AWS SageMaker.",
    "ts": 1770078047
  },
  "auto|specifically in the experiment tracking airflow in the creation of the ETL pipeline.": {
    "translation": "spécifiquement dans l'expérience de suivi de l'écoulement d'air dans la création du pipeline ETL.",
    "ts": 1770078048
  },
  "auto|And finally, the Python programming language, uh, is the programming language that we are going to": {
    "translation": "Et enfin, le langage de programmation Python, euh, est le langage de programmation que nous allons utiliser.",
    "ts": 1770078049
  },
  "auto|Then you have Grafana.": {
    "translation": "Ensuite, vous avez Grafana.",
    "ts": 1770078049
  },
  "auto|Automated deployment.": {
    "translation": "Déploiement automatisé.",
    "ts": 1770078050
  },
  "auto|As I said, to define workflows and all, we will be creating GitHub actions to Dockerize.": {
    "translation": "Comme je l'ai dit, pour définir les workflows et tout, nous allons créer des actions GitHub pour Dockeriser.",
    "ts": 1770078050
  },
  "auto|So that is what my main aim is to make it completely industry standard.": {
    "translation": "C'est donc mon objectif principal : le rendre totalement conforme aux standards de l'industrie.",
    "ts": 1770078050
  },
  "auto|Okay, that will be more than sufficient.": {
    "translation": "D'accord, cela suffira largement.",
    "ts": 1770078052
  },
  "auto|use.": {
    "translation": "Utiliser.",
    "ts": 1770078052
  },
  "auto|GitHub will be my repository because it is completely available for free Then AWS is the cloud platform": {
    "translation": "GitHub sera mon dépôt car il est complètement gratuit. Ensuite, AWS est la plateforme de cloud.",
    "ts": 1770078052
  },
  "auto|Now this GitHub action will actually help us to do the automated deployment okay.": {
    "translation": "Cette action GitHub va nous aider à faire un déploiement automatisé, OK.",
    "ts": 1770078053
  },
  "auto|I've given the recordings of entire git, and then step by step we will follow each and every like how": {
    "translation": "J'ai fourni les enregistrements de tout le git, et ensuite étape par étape, nous allons suivre chaque élément, comme ci, comme ça.",
    "ts": 1770078054
  },
  "auto|How to read a YAML file like params, YAML schema, YAML files.": {
    "translation": "Comment lire un fichier YAML comme les paramètres, le schéma YAML, les fichiers YAML.",
    "ts": 1770078054
  },
  "auto|Along with this, uh, some some some important, some some some basic understanding about git.": {
    "translation": "En plus de cela, euh, quelques notions importantes, quelques connaissances de base sur Git.",
    "ts": 1770078054
  },
  "auto|This is specifically for visualization so that we'll be able to check the performance of our model.": {
    "translation": "Ceci est spécifiquement pour la visualisation afin que nous puissions vérifier les performances de notre modèle.",
    "ts": 1770078054
  },
  "auto|So astronomer actually provides a framework to manage the airflow okay.": {
    "translation": "Donc l'astronome fournit en fait un cadre pour gérer le flux d'air, ok.",
    "ts": 1770078055
  },
  "auto|Then now there is something called as astronomer.": {
    "translation": "Maintenant, il y a quelque chose qu'on appelle un astronome.",
    "ts": 1770078056
  },
  "auto|And uh, we will also show you like if you are working in a collaborative environment, uh, how DAGs": {
    "translation": "Et, euh, nous allons également vous montrer, par exemple, si vous travaillez dans un environnement collaboratif, euh, comment les DAG (ou les graphes acycliques orientés) s'intègrent.",
    "ts": 1770078057
  },
  "auto|Databases we will be specifically using MongoDB.": {
    "translation": "Nous utiliserons spécifiquement les bases de données MongoDB.",
    "ts": 1770078057
  },
  "auto|I've actually covered each and every modules over here.": {
    "translation": "J'ai effectivement couvert chaque module ici.",
    "ts": 1770078057
  },
  "auto|Our entire application will be using Docker's right.": {
    "translation": "Notre application entière utilisera Docker, bien sûr.",
    "ts": 1770078059
  },
  "auto|I've already told you, I'll make you understand that in the data ingestion, we'll be using MLflow": {
    "translation": "Je te l'ai déjà dit, je vais te faire comprendre que pour l'ingestion de données, nous allons utiliser MLflow.",
    "ts": 1770078059
  },
  "auto|And the best thing about this course is that everything over here, all the tools are open source,": {
    "translation": "Et le meilleur de ce cours, c'est que tout ici, tous les outils sont open source,",
    "ts": 1770078059
  },
  "auto|will be useful.": {
    "translation": "sera utile.",
    "ts": 1770078059
  },
  "auto|Now, as a prerequisite, you need to understand that at least you should know Python programming language.": {
    "translation": "Maintenant, en tant que prérequis, il faut comprendre qu'il est au moins nécessaire de connaître le langage de programmation Python.",
    "ts": 1770078059
  },
  "auto|more things.": {
    "translation": "Plus de choses.",
    "ts": 1770078061
  },
  "auto|Um, thank you for considering the course.": {
    "translation": "Euh, merci de considérer ce cours.",
    "ts": 1770078062
  },
  "auto|So again understand that I'm not going to teach completely from basics.": {
    "translation": "Donc comprenez bien que je ne vais pas enseigner depuis les bases.",
    "ts": 1770078062
  },
  "auto|Similarly, we will go ahead and cover over there.": {
    "translation": "Nous allons également nous y rendre et couvrir cette zone.",
    "ts": 1770078062
  },
  "auto|One more I forgot to add as a logo that is nothing but DAGs hub.": {
    "translation": "Encore une chose que j'ai oubliée d'ajouter en tant que logo, qui est en réalité le DAGs Hub.",
    "ts": 1770078062
  },
  "auto|For the code tracking code commit I will be using git.": {
    "translation": "Pour la validation du code de suivi du code, j'utiliserai git.",
    "ts": 1770078063
  },
  "auto|But anyhow, what I have done is that I've given recordings of the entire Python.": {
    "translation": "Mais de toute façon, ce que j'ai fait, c'est que j'ai fourni des enregistrements de tout Python.",
    "ts": 1770078063
  },
  "auto|I hope you enjoy this particular course.": {
    "translation": "J'espère que vous apprécierez particulièrement ce cours.",
    "ts": 1770078064
  },
  "auto|we'll be using.": {
    "translation": "nous allons utiliser.",
    "ts": 1770078064
  },
  "auto|So yes, this was it from my side.": {
    "translation": "C'est tout de mon côté.",
    "ts": 1770078071
  },
  "auto|So it is a remote repository.": {
    "translation": "C'est un dépôt distant.",
    "ts": 1770078064
  },
  "auto|You should know databases like MongoDB or PostgreSQL, at least how to write some kind of queries.": {
    "translation": "Vous devez connaître des bases de données comme MongoDB ou PostgreSQL, au moins savoir écrire certaines requêtes.",
    "ts": 1770078066
  },
  "auto|So let's start the next module.": {
    "translation": "Commençons maintenant le module suivant.",
    "ts": 1770078066
  },
  "auto|You learn a lot of things.": {
    "translation": "Vous apprenez beaucoup de choses.",
    "ts": 1770078067
  },
  "auto|I'll see you all in the next video.": {
    "translation": "Je vous verrai tous dans la prochaine vidéo.",
    "ts": 1770078069
  },
  "auto|Everything will be practical oriented, and we'll try to develop all our projects like this end to end.": {
    "translation": "Tout sera orienté vers la pratique, et nous allons essayer de développer tous nos projets de la même manière, du début à la fin.",
    "ts": 1770078069
  },
  "auto|So I hope you got an idea about the different, different things that we are going to cover in this": {
    "translation": "J'espère que vous avez une idée des différentes choses que nous allons aborder dans cette vidéo.",
    "ts": 1770078069
  },
  "auto|That is with respect to Python.": {
    "translation": "C'est en ce qui concerne Python.",
    "ts": 1770078071
  },
  "auto|course.": {
    "translation": "Course.",
    "ts": 1770078073
  },
  "auto|But before that we will go ahead and the installation of, you know, uh, the VSCode Anaconda and many": {
    "translation": "Mais avant cela, nous allons poursuivre et l'installation, vous savez, euh, de VSCode, Anaconda et bien d'autres.",
    "ts": 1770078075
  },
  "auto|I'll see you in the next video.": {
    "translation": "À bientôt dans la prochaine vidéo.",
    "ts": 1770078079
  },
  "groq|Hello, this is a short test sentence to verify translation model switching.": {
    "translation": "Bonjour, ceci est une courte phrase de test pour vérifier le changement de modèle de traduction.",
    "ts": 1770078282
  },
  "google|This is a short test.": {
    "translation": "Ceci est un court test.",
    "ts": 1770079687
  },
  "google|Hello there.": {
    "translation": "Bonjour.",
    "ts": 1770079687
  },
  "google|Let's check in-memory TTS splitting.": {
    "translation": "Vérifions le fractionnement TTS en mémoire.",
    "ts": 1770079687
  },
  "google|We'll talk about them.": {
    "translation": "Nous en parlerons.",
    "ts": 1770079798
  },
  "google|We have Postgres Grace.": {
    "translation": "Nous avons Postgres Grace.",
    "ts": 1770079798
  },
  "google|We have MongoDB.": {
    "translation": "Nous avons MongoDB.",
    "ts": 1770079799
  },
  "google|And in this entire course, what all MLOps tools we are going to specifically cover and how it is basically": {
    "translation": "Et dans tout ce cours, quels outils MLOps nous allons spécifiquement couvrir et comment ils sont fondamentalement",
    "ts": 1770079799
  },
  "google|In this video, I will be talking about the life cycle of a data science project.": {
    "translation": "Dans cette vidéo, je parlerai du cycle de vie d'un projet de science des données.",
    "ts": 1770079799
  },
  "google|logo of every MLOps tools that we are covering in this course.": {
    "translation": "logo de tous les outils MLOps que nous couvrons dans ce cours.",
    "ts": 1770079799
  },
  "google|course with end to end data science project.": {
    "translation": "cours avec projet de science des données de bout en bout.",
    "ts": 1770079799
  },
  "google|Okay.": {
    "translation": "D'accord.",
    "ts": 1770079799
  },
  "google|Right.": {
    "translation": "Droite.",
    "ts": 1770079799
  },
  "google|You know?": {
    "translation": "Tu sais?",
    "ts": 1770079799
  },
  "google|We have Grafana.": {
    "translation": "Nous avons Grafana.",
    "ts": 1770079799
  },
  "google|What does a data scientist actually do?": {
    "translation": "Que fait réellement un data scientist ?",
    "ts": 1770079799
  },
  "google|We have Amazon SageMaker.": {
    "translation": "Nous avons Amazon SageMaker.",
    "ts": 1770079799
  },
  "google|What does a big data engineer specifically do?": {
    "translation": "Que fait spécifiquement un ingénieur Big Data ?",
    "ts": 1770079799
  },
  "google|So if you probably see this, I've created so many diagrams and here I have, I have just put up the": {
    "translation": "Donc, si vous voyez probablement ceci, j'ai créé tellement de diagrammes et voilà, je viens de mettre en ligne le",
    "ts": 1770079800
  },
  "google|So we have DVC, we have MLflow, we have Apache Airflow, we have astronomer, we have git, we have": {
    "translation": "Nous avons donc DVC, nous avons MLflow, nous avons Apache Airflow, nous avons astronome, nous avons git, nous avons",
    "ts": 1770079800
  },
  "google|going to use in which module it is basically going to use.": {
    "translation": "va utiliser dans quel module il va essentiellement utiliser.",
    "ts": 1770079800
  },
  "google|Hello guys, so thank you for considering this amazing course, which is a complete comprehensive MLOps": {
    "translation": "Bonjour les gars, merci d'avoir envisagé ce cours incroyable, qui est un MLOps complet et complet.",
    "ts": 1770079800
  },
  "google|GitHub, we have AWS, we have Docker, we have GitHub action.": {
    "translation": "GitHub, nous avons AWS, nous avons Docker, nous avons l'action GitHub.",
    "ts": 1770079800
  },
  "google|And we have Python.": {
    "translation": "Et nous avons Python.",
    "ts": 1770079800
  },
  "google|Azure.": {
    "translation": "Azuré.",
    "ts": 1770079980
  },
  "google|But before going ahead.": {
    "translation": "Mais avant d'aller de l'avant.",
    "ts": 1770079980
  },
  "google|more about the life cycle of a data science project.": {
    "translation": "en savoir plus sur le cycle de vie d'un projet de science des données.",
    "ts": 1770079980
  },
  "google|you know, now in the requirement gathering, we have uh, domain experts or product owner along with": {
    "translation": "vous savez, maintenant, dans la collecte des exigences, nous avons des experts du domaine ou des propriétaires de produits ainsi que",
    "ts": 1770079980
  },
  "google|You really need to understand what is an MLOps engineer specifically do in an end to end data science": {
    "translation": "Vous devez vraiment comprendre ce que fait spécifiquement un ingénieur MLOps dans une science des données de bout en bout",
    "ts": 1770079980
  },
  "google|So first of all, the first task, the first step is basically with the requirement that gatherings,": {
    "translation": "Donc tout d'abord, la première tâche, la première étape consiste essentiellement à exiger que les rassemblements,",
    "ts": 1770079980
  },
  "google|project.": {
    "translation": "projet.",
    "ts": 1770079980
  },
  "google|So here, um, see, understand in order to understand the life cycle of a data science project.": {
    "translation": "Alors ici, euh, voyez, comprenez afin de comprendre le cycle de vie d'un projet de science des données.",
    "ts": 1770079980
  },
  "google|data analyst.": {
    "translation": "analyste de données.",
    "ts": 1770079980
  },
  "google|And then what we'll do is that while we are discussing this life cycle, where all which all MLOps tools": {
    "translation": "Et puis ce que nous ferons, c'est que pendant que nous discutons de ce cycle de vie, où tous les outils MLOps",
    "ts": 1770079980
  },
  "google|So first I will talk about the life cycle of a data science project.": {
    "translation": "Je vais donc d’abord parler du cycle de vie d’un projet de science des données.",
    "ts": 1770079980
  },
  "google|So if you probably see this two diagrams, this one diagram and the other diagram over here, this is": {
    "translation": "Donc, si vous voyez probablement ces deux diagrammes, celui-ci et l'autre diagramme ici, c'est",
    "ts": 1770079980
  },
  "google|They will be a lot of different roles and responsibilities like domain expert or product owner.": {
    "translation": "Ils assumeront de nombreux rôles et responsabilités différents, comme expert de domaine ou propriétaire de produit.",
    "ts": 1770079981
  },
  "google|domain knowledge with respect to this particular data science project.": {
    "translation": "connaissance du domaine en ce qui concerne ce projet particulier de science des données.",
    "ts": 1770079981
  },
  "google|Let's say this particular project is coming from a product based company.": {
    "translation": "Disons que ce projet particulier provient d'une entreprise basée sur les produits.",
    "ts": 1770079981
  },
  "google|And when I say domain expert or product owner, this person will be having an extreme good amount of": {
    "translation": "Et quand je parle d'expert de domaine ou de propriétaire de produit, cette personne aura une très bonne quantité de",
    "ts": 1770079981
  },
  "google|So the data science project may be coming from a retail department.": {
    "translation": "Le projet de science des données peut donc provenir d'un département de vente au détail.",
    "ts": 1770079981
  },
  "google|Web app itself.": {
    "translation": "Application Web elle-même.",
    "ts": 1770079981
  },
  "google|business analyst.": {
    "translation": "analyste d'affaires.",
    "ts": 1770079981
  },
  "google|right?": {
    "translation": "droite?",
    "ts": 1770079981
  },
  "google|So if you are probably seeing in a data science team, uh, they will only not be data scientist or": {
    "translation": "Donc, si vous voyez probablement dans une équipe de science des données, euh, ils ne seront pas seulement des data scientists ou",
    "ts": 1770079981
  },
  "google|So first of all, let's say that there is a data science project or a big data engineering project,": {
    "translation": "Alors tout d'abord, disons qu'il y a un projet de data science ou un projet d'ingénierie big data,",
    "ts": 1770079981
  },
  "google|in this particular course, we will also be including this entire MLOps tool.": {
    "translation": "dans ce cours particulier, nous inclurons également l'intégralité de cet outil MLOps.",
    "ts": 1770079981
  },
  "google|deploy in Azure Web container itself.": {
    "translation": "déployer dans le conteneur Web Azure lui-même.",
    "ts": 1770079981
  },
  "google|So Azure is also covered over here.": {
    "translation": "Azure est donc également couvert ici.",
    "ts": 1770079981
  },
  "google|Uh, I've shown the deployment how you can probably convert that into a Docker container and probably": {
    "translation": "Euh, j'ai montré le déploiement comment vous pouvez probablement le convertir en un conteneur Docker et probablement",
    "ts": 1770079981
  },
  "google|will be using, where, you know, because in our end to end data science project that we have discussed": {
    "translation": "utilisera, où, vous savez, parce que dans notre projet de science des données de bout en bout dont nous avons discuté",
    "ts": 1770079981
  },
  "google|Um, along with this, you know, one more cloud that I've actually used in one of the project is about": {
    "translation": "Euh, en plus de ça, vous savez, un autre cloud que j'ai utilisé dans l'un des projets concerne",
    "ts": 1770079981
  },
  "google|So everything will be discussing in this specific course.": {
    "translation": "Tout sera donc abordé dans ce cours spécifique.",
    "ts": 1770079981
  },
  "google|So obviously the person who is experienced in this domain will be the product owner.": {
    "translation": "Il est donc évident que la personne expérimentée dans ce domaine sera le propriétaire du produit.",
    "ts": 1770079981
  },
  "google|Now this person along with the business analyst.": {
    "translation": "Maintenant, cette personne avec l'analyste commercial.",
    "ts": 1770079981
  },
  "google|the whole world itself.": {
    "translation": "le monde entier lui-même.",
    "ts": 1770079981
  },
  "google|So here the entire requirements will be prepared.": {
    "translation": "C'est donc ici que toutes les exigences seront préparées.",
    "ts": 1770079981
  },
  "google|and they will jot down all the requirements.": {
    "translation": "et ils noteront toutes les exigences.",
    "ts": 1770079981
  },
  "google|And they will write down all the requirements like uh, what all stories needs to be completed and they": {
    "translation": "Et ils écriront toutes les exigences, comme euh, ce que toutes les histoires doivent être complétées et ils",
    "ts": 1770079981
  },
  "google|So uh, they will write down all the requirements.": {
    "translation": "Donc euh, ils écriront toutes les exigences.",
    "ts": 1770079981
  },
  "google|So let's say that these two group of people are like these two people.": {
    "translation": "Disons donc que ces deux groupes de personnes sont comme ces deux personnes.",
    "ts": 1770079981
  },
  "google|And all right.": {
    "translation": "Et très bien.",
    "ts": 1770079981
  },
  "google|So this business analyst, along with the domain expert or product owner, they will have a lot of discussion": {
    "translation": "Ainsi, cet analyste commercial, ainsi que l'expert du domaine ou le propriétaire du produit, auront beaucoup de discussions",
    "ts": 1770079981
  },
  "google|You'll also be having business analyst.": {
    "translation": "Vous aurez également un analyste commercial.",
    "ts": 1770079981
  },
  "google|They follow an agile process.": {
    "translation": "Ils suivent un processus agile.",
    "ts": 1770079982
  },
  "google|There is like waterfall model and all.": {
    "translation": "Il y a comme un modèle en cascade et tout.",
    "ts": 1770079982
  },
  "google|You know we specifically use agile process.": {
    "translation": "Vous savez que nous utilisons spécifiquement des processus agiles.",
    "ts": 1770079982
  },
  "google|It may be coming from the e-commerce department.": {
    "translation": "Cela vient peut-être du département e-commerce.",
    "ts": 1770079982
  },
  "google|And here with respect to this particular use case, we are going to solve this data science project.": {
    "translation": "Et ici, en ce qui concerne ce cas d'utilisation particulier, nous allons résoudre ce projet de science des données.",
    "ts": 1770079982
  },
  "google|It may be coming from different different departments.": {
    "translation": "Cela peut provenir de différents départements.",
    "ts": 1770079982
  },
  "google|each and every sprint they will try to divide this requirements like which all modules needs to be developed": {
    "translation": "à chaque sprint, ils essaieront de diviser ces exigences selon lesquelles tous les modules doivent être développés",
    "ts": 1770079982
  },
  "google|So this person will know that what is that data science project that they really want to implement?": {
    "translation": "Ainsi, cette personne saura quel est ce projet de science des données qu’elle souhaite vraiment mettre en œuvre ?",
    "ts": 1770079982
  },
  "google|So once that requirements is basically written down okay, then all these requirements are sent to the": {
    "translation": "Donc, une fois que ces exigences sont essentiellement écrites, toutes ces exigences sont envoyées au",
    "ts": 1770079982
  },
  "google|in sprint one, which all module needs to be developed in sprint two.": {
    "translation": "dans le sprint un, dont tous les modules doivent être développés dans le sprint deux.",
    "ts": 1770079982
  },
  "google|foreign countries and also you really get a good amount of chance to interact with them travel, travel": {
    "translation": "pays étrangers et vous avez également de nombreuses chances d'interagir avec eux, de voyager, de voyager",
    "ts": 1770079982
  },
  "google|What I feel because if your if your uh uh if your specifically like if your client is in some different": {
    "translation": "Ce que je ressens parce que si vous êtes euh euh si vous aimez spécifiquement si votre client est dans un endroit différent",
    "ts": 1770079982
  },
  "google|So here business analyst are the most luckiest people.": {
    "translation": "Ici, les analystes commerciaux sont les personnes les plus chanceuses.",
    "ts": 1770079982
  },
  "google|or product owner and they will try to find out like what all data, what all data will be required in": {
    "translation": "ou le propriétaire du produit et ils essaieront de savoir quelles sont toutes les données, dans quelles données elles seront nécessaires",
    "ts": 1770079982
  },
  "google|Now again, this data analyst and data science team will have a discussion with the domain expertise": {
    "translation": "Là encore, cette équipe d'analystes de données et de science des données aura une discussion avec l'expertise du domaine",
    "ts": 1770079982
  },
  "google|Solve this particular problem.": {
    "translation": "Résolvez ce problème particulier.",
    "ts": 1770079982
  },
  "google|Now when I say identifying the data that basically means, uh, you know, they'll try to identify the": {
    "translation": "Maintenant, quand je dis identifier les données, cela signifie essentiellement, euh, vous savez, ils vont essayer d'identifier les",
    "ts": 1770079982
  },
  "google|source of the data okay.": {
    "translation": "source des données, ok.",
    "ts": 1770079982
  },
  "google|will try to divide this entire story in the form of sprints.": {
    "translation": "Je vais essayer de diviser toute cette histoire sous forme de sprints.",
    "ts": 1770079982
  },
  "google|Okay, so here in a data science project, also we are in most of the companies.": {
    "translation": "D'accord, donc ici, dans un projet de science des données, nous sommes également présents dans la plupart des entreprises.",
    "ts": 1770079982
  },
  "google|Now data may be present in the internal database.": {
    "translation": "Désormais, les données peuvent être présentes dans la base de données interne.",
    "ts": 1770079982
  },
  "google|Now agile process basically means like they are different different process of development.": {
    "translation": "Désormais, le processus agile signifie fondamentalement qu'il s'agit de processus de développement différents.",
    "ts": 1770079982
  },
  "google|So in most of the data science project, what I have seen in my experience, they usually follow an": {
    "translation": "Ainsi, dans la plupart des projets de science des données, ce que j'ai vu dans mon expérience, ils suivent généralement un",
    "ts": 1770079982
  },
  "google|agile process where they create sprints like there will be sprint one, there will be sprint two, and": {
    "translation": "processus agile où ils créent des sprints comme s'il y aurait un sprint un, il y aurait un sprint deux, et",
    "ts": 1770079983
  },
  "google|data analyst or data scientist team specifically in a data science project.": {
    "translation": "équipe d’analystes de données ou de data scientists spécifiquement dans un projet de science des données.",
    "ts": 1770079983
  },
  "google|So they will be identifying the data right.": {
    "translation": "Ils identifieront donc correctement les données.",
    "ts": 1770079983
  },
  "google|order to solve this particular project.": {
    "translation": "afin de résoudre ce projet particulier.",
    "ts": 1770079983
  },
  "google|They will be specifically identifying the data.": {
    "translation": "Ils identifieront spécifiquement les données.",
    "ts": 1770079983
  },
  "google|right, we will capture all this particular source, and then we will combine all those data in the": {
    "translation": "à droite, nous allons capturer toute cette source particulière, puis nous combinerons toutes ces données dans le",
    "ts": 1770080547
  },
  "google|lot of IoT devices and we used to capture those specific data.": {
    "translation": "beaucoup d'appareils IoT et nous avions l'habitude de capturer ces données spécifiques.",
    "ts": 1770080547
  },
  "google|Now, one of the most common data pipeline that you will be seeing in the industries that will be done": {
    "translation": "Désormais, l'un des pipelines de données les plus courants que vous verrez dans les secteurs qui seront réalisés",
    "ts": 1770080547
  },
  "google|It can be PostgreSQL and all.": {
    "translation": "Cela peut être PostgreSQL et tout.",
    "ts": 1770080547
  },
  "google|It may also be an API data.": {
    "translation": "Il peut également s'agir d'une donnée API.",
    "ts": 1770080547
  },
  "google|Once they identify the data source then here my big data engineering team will come into picture now,": {
    "translation": "Une fois qu'ils auront identifié la source de données, mon équipe d'ingénierie Big Data entrera en scène maintenant,",
    "ts": 1770080547
  },
  "google|So we need to identify the data and to identify the data.": {
    "translation": "Nous devons donc identifier les données et identifier les données.",
    "ts": 1770080547
  },
  "google|We do some kind of transformation, and then we finally load that entire combined data into some data": {
    "translation": "Nous effectuons une sorte de transformation, puis nous chargeons finalement l'intégralité de ces données combinées dans certaines données.",
    "ts": 1770080547
  },
  "google|We basically extract from multiple data sources.": {
    "translation": "Nous extrayons essentiellement de plusieurs sources de données.",
    "ts": 1770080547
  },
  "google|Again, we will be requiring the help of a product owner or domain expertise because they may also be": {
    "translation": "Encore une fois, nous aurons besoin de l'aide d'un propriétaire de produit ou d'une expertise dans le domaine, car ils peuvent également être",
    "ts": 1770080547
  },
  "google|They may be dependent on some third parties and all.": {
    "translation": "Ils peuvent dépendre de certains tiers et de tous.",
    "ts": 1770080547
  },
  "google|source like MongoDB.": {
    "translation": "source comme MongoDB.",
    "ts": 1770080547
  },
  "google|Data pipeline.": {
    "translation": "Pipeline de données.",
    "ts": 1770080547
  },
  "google|Okay, ETL pipeline.": {
    "translation": "D'accord, pipeline ETL.",
    "ts": 1770080547
  },
  "google|Now this ETL pipeline is nothing but extract, transform and load okay.": {
    "translation": "Maintenant, ce pipeline ETL ne sert qu'à extraire, transformer et charger correctement.",
    "ts": 1770080547
  },
  "google|Uh, in in my previous companies where I was working with electronics goods, you know, there we had": {
    "translation": "Euh, dans mes entreprises précédentes où je travaillais dans le secteur de l'électronique, vous savez, nous avions",
    "ts": 1770080547
  },
  "google|It may be an IoT data also.": {
    "translation": "Il peut également s'agir de données IoT.",
    "ts": 1770080547
  },
  "google|So those kind of data, they will first of all identify.": {
    "translation": "Donc ce genre de données, ils vont tout d’abord les identifier.",
    "ts": 1770080547
  },
  "google|form of data pipeline.": {
    "translation": "forme de pipeline de données.",
    "ts": 1770080547
  },
  "google|because this actually helps you to schedule the right schedule.": {
    "translation": "parce que cela vous aide réellement à planifier le bon horaire.",
    "ts": 1770080547
  },
  "google|And we will specifically use Apache Airflow over here.": {
    "translation": "Et nous utiliserons spécifiquement Apache Airflow ici.",
    "ts": 1770080547
  },
  "google|Also I have taken a couple of projects and I will show you how an ETL pipeline will be used.": {
    "translation": "J'ai également pris quelques projets et je vais vous montrer comment un pipeline ETL sera utilisé.",
    "ts": 1770080547
  },
  "google|get that particular data so I can actually schedule this with the help of Apache Airflow.": {
    "translation": "obtenir ces données particulières afin que je puisse réellement planifier cela avec l'aide d'Apache Airflow.",
    "ts": 1770080547
  },
  "google|So here in this MLOps project, you know, my main aim was to give you the, uh, the crux of each and": {
    "translation": "Donc ici, dans ce projet MLOps, vous savez, mon objectif principal était de vous donner le point crucial de chacun et",
    "ts": 1770080547
  },
  "google|So here we will be covering this entire ETL pipeline.": {
    "translation": "Nous couvrirons donc ici l’intégralité de ce pipeline ETL.",
    "ts": 1770080547
  },
  "google|And we will be creating this ETL pipeline.": {
    "translation": "Et nous allons créer ce pipeline ETL.",
    "ts": 1770080547
  },
  "google|So in this particular uh like in one of the modules right.": {
    "translation": "Donc, dans ce cas particulier, comme dans l'un des modules, c'est vrai.",
    "ts": 1770080547
  },
  "google|And this is one of the amazing MLOps tool, uh, which is basically used to create this ETL pipeline,": {
    "translation": "Et c'est l'un des incroyables outils MLOps, euh, qui est essentiellement utilisé pour créer ce pipeline ETL,",
    "ts": 1770080547
  },
  "google|So I will be focusing on that right.": {
    "translation": "Je vais donc me concentrer là-dessus.",
    "ts": 1770080547
  },
  "google|We will be discussing about data pipeline.": {
    "translation": "Nous discuterons du pipeline de données.",
    "ts": 1770080547
  },
  "google|We will be discussing about ETL pipeline.": {
    "translation": "Nous discuterons du pipeline ETL.",
    "ts": 1770080547
  },
  "google|Because here we'll focus on deployment also how to deploy this entire ETL pipeline.": {
    "translation": "Parce qu'ici, nous nous concentrerons sur le déploiement et sur la manière de déployer l'intégralité de ce pipeline ETL.",
    "ts": 1770080547
  },
  "google|So uh that is what a big data engineer team does.": {
    "translation": "Alors euh, c'est ce que fait une équipe d'ingénieurs Big Data.",
    "ts": 1770080547
  },
  "google|Now, this data pipeline is created in such a way that, first of all, whichever source we are identifying,": {
    "translation": "Maintenant, ce pipeline de données est créé de telle manière que, tout d'abord, quelle que soit la source que nous identifions,",
    "ts": 1770080547
  },
  "google|having the data within the company.": {
    "translation": "disposer des données au sein de l’entreprise.",
    "ts": 1770080547
  },
  "google|because this big data engineering team will now create a data pipeline.": {
    "translation": "car cette équipe d'ingénierie Big Data va désormais créer un pipeline de données.",
    "ts": 1770080547
  },
  "google|by the big data engineering team, it is nothing but the ETL pipeline.": {
    "translation": "par l'équipe d'ingénierie Big Data, ce n'est rien d'autre que le pipeline ETL.",
    "ts": 1770080547
  },
  "google|It may be present in a third party or cloud API.": {
    "translation": "Il peut être présent dans une API tierce ou cloud.",
    "ts": 1770080547
  },
  "google|And for this we'll be using AWS cloud and all.": {
    "translation": "Et pour cela, nous utiliserons le cloud AWS et tout.",
    "ts": 1770080548
  },
  "google|Once that data source is, let's say the data source over here is used as MongoDB, right?": {
    "translation": "Une fois cette source de données créée, disons que la source de données ici est utilisée comme MongoDB, n'est-ce pas ?",
    "ts": 1770080548
  },
  "google|They actually create amazing data pipelines wherein they integrate with multiple data sources and then": {
    "translation": "Ils créent en fait d'étonnants pipelines de données dans lesquels ils s'intègrent à plusieurs sources de données, puis",
    "ts": 1770080548
  },
  "google|That is probably coming from the third party APIs or any other data source.": {
    "translation": "Cela vient probablement des API tierces ou de toute autre source de données.",
    "ts": 1770080548
  },
  "google|try to combine the data and they load it into a specific data source.": {
    "translation": "essayez de combiner les données et ils les chargent dans une source de données spécifique.",
    "ts": 1770080548
  },
  "google|Now, just by understanding this, you are able to understand that how many different roles and responsibilities": {
    "translation": "Maintenant, simplement en comprenant cela, vous êtes en mesure de comprendre combien de rôles et de responsabilités différents",
    "ts": 1770080548
  },
  "google|Then you have business analyst, then you have data scientist, then data analyst, then you have big": {
    "translation": "Ensuite, vous avez un analyste commercial, puis un data scientist, puis un analyste de données, puis vous avez un grand",
    "ts": 1770080548
  },
  "google|That depends on the data.": {
    "translation": "Cela dépend des données.",
    "ts": 1770080548
  },
  "google|daily basis or in a weekly basis.": {
    "translation": "quotidiennement ou sur une base hebdomadaire.",
    "ts": 1770080548
  },
  "google|One of the roles and responsibilities over here are like product owner.": {
    "translation": "L'un des rôles et responsabilités ici est celui de propriétaire de produit.",
    "ts": 1770080548
  },
  "google|Now once this is done, then our life cycle of a data science project comes.": {
    "translation": "Une fois cela fait, vient notre cycle de vie d’un projet de science des données.",
    "ts": 1770080548
  },
  "google|are there, right?": {
    "translation": "il y en a, non ?",
    "ts": 1770080548
  },
  "google|data engineering team, right.": {
    "translation": "équipe d’ingénierie de données, c’est vrai.",
    "ts": 1770080548
  },
  "google|And this entire MLOps course I will cover each and every thing with respect to this, right.": {
    "translation": "Et tout ce cours MLOps, je couvrirai tout et tout à ce sujet, n'est-ce pas.",
    "ts": 1770080548
  },
  "google|Obviously, I will not be covering product owner or business analyst because that is more of a documentation": {
    "translation": "Évidemment, je ne parlerai pas du propriétaire de produit ou de l'analyste commercial car il s'agit plutôt d'une documentation.",
    "ts": 1770080548
  },
  "google|But here from this, identifying the data source and all, we will try to go ahead and implement it.": {
    "translation": "Mais à partir de là, en identifiant la source de données et tout, nous allons essayer d'aller de l'avant et de la mettre en œuvre.",
    "ts": 1770080548
  },
  "google|kind of things.": {
    "translation": "genre de choses.",
    "ts": 1770080548
  },
  "google|Now, once we go to the life cycle of a data science project.": {
    "translation": "Passons maintenant au cycle de vie d’un projet de science des données.",
    "ts": 1770080548
  },
  "google|Because if let's say that my data is basically coming from third party API every day, I need to probably": {
    "translation": "Parce que si disons que mes données proviennent chaque jour d’API tierces, je dois probablement",
    "ts": 1770080548
  },
  "google|everything.": {
    "translation": "tout.",
    "ts": 1770080548
  },
  "google|We'll also be doing the deployment.": {
    "translation": "Nous ferons également le déploiement.",
    "ts": 1770080548
  },
  "google|Like how does a big data engineering team work?": {
    "translation": "Par exemple, comment fonctionne une équipe d’ingénierie Big Data ?",
    "ts": 1770080548
  },
  "google|Now the next thing will be that whatever data has been collected in the data source, right?": {
    "translation": "Maintenant, la prochaine chose sera que quelles que soient les données collectées dans la source de données, n'est-ce pas ?",
    "ts": 1770080548
  },
  "google|Let's say this is my data source.": {
    "translation": "Disons que c'est ma source de données.",
    "ts": 1770080548
  },
  "google|So let's say over here I will just try to connect this okay.": {
    "translation": "Alors disons ici, je vais juste essayer de connecter ça, d'accord.",
    "ts": 1770080548
  },
  "google|I will just try to go ahead and connect this.": {
    "translation": "Je vais juste essayer d'aller de l'avant et de connecter cela.",
    "ts": 1770080548
  },
  "google|In one of the example I have used MongoDB.": {
    "translation": "Dans l'un des exemples, j'ai utilisé MongoDB.",
    "ts": 1770080548
  },
  "google|It can be Postgres, it can be MongoDB.": {
    "translation": "Cela peut être Postgres, cela peut être MongoDB.",
    "ts": 1770080548
  },
  "google|over here, to write it down, it is nothing but data ingestion.": {
    "translation": "ici, pour l'écrire, ce n'est rien d'autre qu'une ingestion de données.",
    "ts": 1770080548
  },
  "google|Now from this particular uh pipeline we are storing it in the MongoDB.": {
    "translation": "Maintenant, à partir de ce pipeline particulier, nous le stockons dans MongoDB.",
    "ts": 1770080549
  },
  "google|So here it is nothing but data Ingestion.": {
    "translation": "Il ne s’agit donc ici que d’ingestion de données.",
    "ts": 1770080549
  },
  "google|So this is the step before feature engineering.": {
    "translation": "C'est donc l'étape précédant l'ingénierie des fonctionnalités.",
    "ts": 1770080549
  },
  "google|Okay, so here my first step is nothing but data ingestion.": {
    "translation": "D'accord, donc ici, ma première étape n'est rien d'autre que l'ingestion de données.",
    "ts": 1770080549
  },
  "google|Or let me do one thing.": {
    "translation": "Ou laissez-moi faire une chose.",
    "ts": 1770080549
  },
  "google|Data ingestion okay.": {
    "translation": "L'ingestion de données est correcte.",
    "ts": 1770080549
  },
  "google|So here is my first step.": {
    "translation": "Voici donc ma première étape.",
    "ts": 1770080549
  },
  "google|Whenever we talk about life cycle or data science project, the first step, which I probably missed": {
    "translation": "A chaque fois qu’on parle de cycle de vie ou de projet de data science, la première étape, que j’ai probablement manquée",
    "ts": 1770080549
  },
  "google|So once this entire data is basically loaded in the MongoDB, this will keep on getting updated in a": {
    "translation": "Ainsi, une fois que toutes ces données sont chargées dans MongoDB, elles continueront à être mises à jour de manière",
    "ts": 1770080549
  },
  "google|They use tools like JIRA confluence to write down all the requirements.": {
    "translation": "Ils utilisent des outils comme JIRA Confluence pour noter toutes les exigences.",
    "ts": 1770080549
  },
  "google|Now from the MongoDB, our life cycle of a data science project starts okay.": {
    "translation": "Maintenant, depuis MongoDB, notre cycle de vie d'un projet de science des données commence bien.",
    "ts": 1770080549
  },
  "google|Now again, here we are.": {
    "translation": "Maintenant encore, nous y sommes.",
    "ts": 1770080549
  },
  "google|How to read the data from MongoDB It can also be how to read data from Postgres.": {
    "translation": "Comment lire les données de MongoDB Cela peut également être comment lire les données de Postgres.",
    "ts": 1770080549
  },
  "google|So I would like to consider as this as my first step okay.": {
    "translation": "J'aimerais donc considérer cela comme ma première étape, d'accord.",
    "ts": 1770080549
  },
  "google|In the data ingestion.": {
    "translation": "Dans l'ingestion de données.",
    "ts": 1770080549
  },
  "google|And uh while we are probably, uh reading it, there will be separate MLOps tools that will be required.": {
    "translation": "Et pendant que nous sommes probablement en train de le lire, des outils MLOps distincts seront nécessaires.",
    "ts": 1770080549
  },
  "google|One of the important MLOps tools that will be used over here is something called as DVC, DVC.": {
    "translation": "L'un des outils MLOps importants qui seront utilisés ici s'appelle DVC, DVC.",
    "ts": 1770080549
  },
  "google|Because data versioning is also important because with respect to every training that we do for our": {
    "translation": "Parce que la gestion des versions des données est également importante, car pour chaque formation que nous effectuons pour notre",
    "ts": 1770080549
  },
  "google|Uh, one of the data source that I have also used is like something called as PostgreSQL.": {
    "translation": "Euh, l'une des sources de données que j'ai également utilisées ressemble à quelque chose appelé PostgreSQL.",
    "ts": 1770080549
  },
  "google|may change.": {
    "translation": "peut changer.",
    "ts": 1770080549
  },
  "google|model, right, it is important that we have a proper versioning of the data because tomorrow the data": {
    "translation": "modèle, c'est vrai, il est important que nous ayons un bon versionnage des données car demain les données",
    "ts": 1770080549
  },
  "google|So let's consider MongoDB MongoDB and this MongoDB will also be hosted in the cloud okay.": {
    "translation": "Considérons donc MongoDB MongoDB et ce MongoDB sera également hébergé dans le cloud, d'accord.",
    "ts": 1770080549
  },
  "google|It may also add some more features inside it.": {
    "translation": "Il peut également y ajouter des fonctionnalités supplémentaires.",
    "ts": 1770080549
  },
  "google|Let me just draw it on the top so that it will be easy for you to understand.": {
    "translation": "Permettez-moi de le dessiner en haut pour que vous puissiez le comprendre facilement.",
    "ts": 1770080549
  },
  "google|So here, uh, if I talk about DVC, DVC is one MLOps tools, which I'm actually going to use over here": {
    "translation": "Donc ici, euh, si je parle de DVC, DVC est l'un des outils MLOps, que je vais en fait utiliser ici",
    "ts": 1770080549
  },
  "google|Then I go to this my next step.": {
    "translation": "Ensuite, je passe à ma prochaine étape.",
    "ts": 1770080549
  },
  "google|While we are creating the data pipeline, we will be specifically using airflow, you know, to probably": {
    "translation": "Pendant que nous créons le pipeline de données, nous utiliserons spécifiquement le flux d'air, vous savez, probablement pour",
    "ts": 1770080550
  },
  "google|engineering.": {
    "translation": "ingénierie.",
    "ts": 1770080550
  },
  "google|Otherwise this course will go on very long.": {
    "translation": "Sinon, ce cours durera très longtemps.",
    "ts": 1770080550
  },
  "google|Now what is the work in data ingestion here.": {
    "translation": "Maintenant, quel est le travail d'ingestion de données ici.",
    "ts": 1770080550
  },
  "google|Uh our main aim is to read the data from data source okay.": {
    "translation": "Euh, notre objectif principal est de lire les données de la source de données, d'accord.",
    "ts": 1770080550
  },
  "google|Then we go to feature engineering feature selection and all.": {
    "translation": "Ensuite, nous passons à la sélection des fonctionnalités d’ingénierie et tout.",
    "ts": 1770080550
  },
  "google|to end project.": {
    "translation": "pour terminer le projet.",
    "ts": 1770080550
  },
  "google|So whenever I talk about data ingestion I will be showing you how to read the data from cloud.": {
    "translation": "Ainsi, chaque fois que je parlerai d’ingestion de données, je vous montrerai comment lire les données depuis le cloud.",
    "ts": 1770080550
  },
  "google|But some basic feature engineering so that I show you in a specific end to end project complete end": {
    "translation": "Mais quelques fonctionnalités d'ingénierie de base afin que je vous montre la fin complète du projet de bout en bout spécifique",
    "ts": 1770080550
  },
  "google|Let's say how to read the data from S3 bucket or AWS S3 bucket.": {
    "translation": "Disons comment lire les données du compartiment S3 ou du compartiment AWS S3.",
    "ts": 1770080550
  },
  "google|So all these kind of examples, we will try to cover it up.": {
    "translation": "Donc, avec tous ces exemples, nous allons essayer de les dissimuler.",
    "ts": 1770080550
  },
  "google|But, uh, if you probably see some other courses of mine like machine learning and all that, I have": {
    "translation": "Mais, euh, si vous voyez probablement d'autres de mes cours comme l'apprentissage automatique et tout ça, j'ai",
    "ts": 1770080550
  },
  "google|focused more on feature engineering and feature selection.": {
    "translation": "axé davantage sur l’ingénierie des fonctionnalités et la sélection des fonctionnalités.",
    "ts": 1770080550
  },
  "google|So here you will be able to see that I have used DVC.": {
    "translation": "Vous pourrez donc voir ici que j'ai utilisé DVC.",
    "ts": 1770080550
  },
  "google|DVC basically means data versioning control.": {
    "translation": "DVC signifie essentiellement le contrôle de version des données.",
    "ts": 1770080550
  },
  "google|Then we have feature selection where we probably select the best features that is required for the model.": {
    "translation": "Ensuite, nous avons la sélection des fonctionnalités où nous sélectionnons probablement les meilleures fonctionnalités requises pour le modèle.",
    "ts": 1770080550
  },
  "google|So this is one of the module like feature transformation where we specifically do EDA handling missing": {
    "translation": "C'est donc l'un des modules comme la transformation des fonctionnalités où nous effectuons spécifiquement la gestion EDA manquante",
    "ts": 1770080550
  },
  "google|values, handling outliers and all.": {
    "translation": "valeurs, gestion des valeurs aberrantes et tout.",
    "ts": 1770080550
  },
  "google|So we'll be talking about like why DVC will be important over here.": {
    "translation": "Nous allons donc parler de la raison pour laquelle DVC sera important ici.",
    "ts": 1770080550
  },
  "google|It may change the entire data format itself which is coming from the data source.": {
    "translation": "Cela peut modifier l'intégralité du format de données lui-même provenant de la source de données.",
    "ts": 1770080550
  },
  "google|Now for model creation hyperparameter tuning I will be using multiple models.": {
    "translation": "Désormais, pour le réglage des hyperparamètres de création de modèle, j'utiliserai plusieurs modèles.",
    "ts": 1770080550
  },
  "google|That is model creation and hyperparameter tuning.": {
    "translation": "Il s’agit de la création de modèles et du réglage des hyperparamètres.",
    "ts": 1770080550
  },
  "google|I've also used Randomizedsearchcv in one example.": {
    "translation": "J'ai également utilisé Randomizedsearchcv dans un exemple.",
    "ts": 1770080550
  },
  "google|CV.": {
    "translation": "CV.",
    "ts": 1770080550
  },
  "google|We will try to perform different different hyperparameter tuning will try to select the different parameters.": {
    "translation": "Nous allons essayer d'effectuer différents réglages d'hyperparamètres et essayer de sélectionner les différents paramètres.",
    "ts": 1770080550
  },
  "google|One example I've shown with the help of Hyperopt.": {
    "translation": "Un exemple que j'ai montré avec l'aide d'Hyperopt.",
    "ts": 1770080550
  },
  "google|And the reason why I'm doing this, because after I perform the hyperparameter tuning, I have to log": {
    "translation": "Et la raison pour laquelle je fais cela, c'est qu'après avoir effectué le réglage des hyperparamètres, je dois me connecter",
    "ts": 1770080550
  },
  "google|in big data engineering team.": {
    "translation": "dans l'équipe d'ingénierie Big Data.",
    "ts": 1770080550
  },
  "google|each and every metrics.": {
    "translation": "chaque métrique.",
    "ts": 1770080550
  },
  "google|create the entire ETL pipeline.": {
    "translation": "créer l'intégralité du pipeline ETL.",
    "ts": 1770080551
  },
  "google|Then after this, we go to the feature engineering.": {
    "translation": "Ensuite, nous passons à l’ingénierie des fonctionnalités.",
    "ts": 1770080551
  },
  "google|Experiment tracking will happen over here.": {
    "translation": "Le suivi des expériences aura lieu ici.",
    "ts": 1770080551
  },
  "google|And here I will be using something called as MLflow, because here we are going to probably track experiments.": {
    "translation": "Et ici, j'utiliserai quelque chose appelé MLflow, car ici nous allons probablement suivre des expériences.",
    "ts": 1770080551
  },
  "google|Now this experiment tracking how it is basically happening.": {
    "translation": "Maintenant, cette expérience suit comment cela se produit fondamentalement.",
    "ts": 1770080551
  },
  "google|Again, in this course we have not focused more on feature engineering or different types of feature": {
    "translation": "Encore une fois, dans ce cours, nous ne nous sommes pas davantage concentrés sur l'ingénierie des fonctionnalités ou sur les différents types de fonctionnalités.",
    "ts": 1770080551
  },
  "google|Not only that will deploy this MLflow in remote repository or in AWS.": {
    "translation": "Non seulement cela déploiera ce MLflow dans un référentiel distant ou dans AWS.",
    "ts": 1770080551
  },
  "google|We are going to use a remote repository called a DAGs hub.": {
    "translation": "Nous allons utiliser un référentiel distant appelé hub DAG.",
    "ts": 1770080551
  },
  "google|So you will be able to see all this kind of hyperparameter tuning when I am doing it.": {
    "translation": "Vous pourrez donc voir tout ce genre de réglage d’hyperparamètres lorsque je le ferai.",
    "ts": 1770080551
  },
  "google|So here specifically we will be using MLflow for experiment tracking.": {
    "translation": "Nous utiliserons donc ici spécifiquement MLflow pour le suivi des expériences.",
    "ts": 1770080551
  },
  "google|We will be using that also.": {
    "translation": "Nous l'utiliserons également.",
    "ts": 1770080551
  },
  "google|parameter.": {
    "translation": "paramètre.",
    "ts": 1770080551
  },
  "google|Dockers and all.": {
    "translation": "Les dockers et tout.",
    "ts": 1770080551
  },
  "google|So here, uh, there is a detailed module about understanding about Dockers, how you can work with": {
    "translation": "Donc ici, il y a un module détaillé sur la compréhension de Dockers, comment vous pouvez travailler avec",
    "ts": 1770080551
  },
  "google|Uh, when I talk about model deployment, um, I'll be using clouds like AWS and Azure.": {
    "translation": "Euh, quand je parle de déploiement de modèles, euh, j'utiliserai des cloud comme AWS et Azure.",
    "ts": 1770080551
  },
  "google|Then we have this model deployment next stage.": {
    "translation": "Ensuite, nous avons la prochaine étape de déploiement de ce modèle.",
    "ts": 1770080551
  },
  "google|So two clouds will be more than sufficient in this particular course.": {
    "translation": "Deux nuages ​​seront donc largement suffisants dans ce parcours particulier.",
    "ts": 1770080551
  },
  "google|In other I have specifically gone with AWS.": {
    "translation": "Dans d'autres, j'ai spécifiquement opté pour AWS.",
    "ts": 1770080551
  },
  "google|You know, um, I have also used, uh, AWS SageMaker.": {
    "translation": "Vous savez, euh, j'ai également utilisé, euh, AWS SageMaker.",
    "ts": 1770080551
  },
  "google|build, deploy, create endpoints directly inside your AWS infrastructure itself.": {
    "translation": "construisez, déployez, créez des points de terminaison directement dans votre infrastructure AWS elle-même.",
    "ts": 1770080551
  },
  "google|So experiment tracking will happen over here.": {
    "translation": "Le suivi des expériences se fera donc ici.",
    "ts": 1770080551
  },
  "google|And then you can also go ahead and try out.": {
    "translation": "Et puis vous pouvez aussi essayer.",
    "ts": 1770080551
  },
  "google|One example I've shown with Gridsearchcv.": {
    "translation": "Un exemple que j'ai montré avec Gridsearchcv.",
    "ts": 1770080551
  },
  "google|So that project is also probably taken over here.": {
    "translation": "Ce projet est donc probablement également repris ici.",
    "ts": 1770080551
  },
  "google|Then, uh, we will be understanding about dockers, how to dockerize your container and all.": {
    "translation": "Ensuite, nous comprendrons les dockers, comment dockeriser votre conteneur et tout.",
    "ts": 1770080551
  },
  "google|And here we are specifically going to use MLflow.": {
    "translation": "Et ici, nous allons spécifiquement utiliser MLflow.",
    "ts": 1770080551
  },
  "google|Now model monitoring.": {
    "translation": "Maintenant, la surveillance du modèle.",
    "ts": 1770080552
  },
  "google|Then coming to the last stage, which is nothing but model monitoring.": {
    "translation": "Venons-en ensuite à la dernière étape, qui n’est rien d’autre qu’un suivi de modèle.",
    "ts": 1770080552
  },
  "google|So if I talk about DAGs hub this is another remote repository.": {
    "translation": "Donc, si je parle du hub DAG, il s'agit d'un autre référentiel distant.",
    "ts": 1770080552
  },
  "google|based on that.": {
    "translation": "basé sur cela.",
    "ts": 1770080552
  },
  "google|And for this also we are going to use an MLOps tool which is called as Grafana.": {
    "translation": "Et pour cela également, nous allons utiliser un outil MLOps appelé Grafana.",
    "ts": 1770080552
  },
  "google|We'll probably visualize things.": {
    "translation": "Nous allons probablement visualiser les choses.",
    "ts": 1770080552
  },
  "google|And if I just show you the logo over here.": {
    "translation": "Et si je vous montre juste le logo ici.",
    "ts": 1770080552
  },
  "google|So Grafana is basically used.": {
    "translation": "Grafana est donc essentiellement utilisé.",
    "ts": 1770080552
  },
  "google|Now this is the most important step.": {
    "translation": "C’est maintenant l’étape la plus importante.",
    "ts": 1770080552
  },
  "google|in the Grafana.": {
    "translation": "dans la Grafana.",
    "ts": 1770080552
  },
  "google|And I'll try to show you through the basic example like how a rules is basically set in the Grafana,": {
    "translation": "Et je vais essayer de vous montrer à travers l'exemple de base, comme comment les règles sont essentiellement définies dans le Grafana,",
    "ts": 1770080552
  },
  "google|how the visualization is basically created, how each and every graph is created, and all that we'll": {
    "translation": "comment la visualisation est essentiellement créée, comment chaque graphique est créé, et tout ce que nous verrons",
    "ts": 1770080552
  },
  "google|And here you can see that MLflow is also one of the MLOps tools that we will be using over here.": {
    "translation": "Et ici, vous pouvez voir que MLflow est également l'un des outils MLOps que nous utiliserons ici.",
    "ts": 1770080552
  },
  "google|Uh, everything like Docker compose, everything is basically explained in that particular module.": {
    "translation": "Euh, tout comme Docker Compose, tout est essentiellement expliqué dans ce module particulier.",
    "ts": 1770080552
  },
  "google|So overall, uh, in this entire, uh, entire lifecycle of a data science project, creating life cycle": {
    "translation": "Donc, dans l'ensemble, euh, dans tout ce, euh, tout le cycle de vie d'un projet de science des données, la création d'un cycle de vie",
    "ts": 1770080552
  },
  "google|or creating a data science project will be very easy.": {
    "translation": "ou créer un projet de science des données sera très simple.",
    "ts": 1770080552
  },
  "google|In one of the course, I have, uh, in one of the module I have implemented both with AWS Azure.": {
    "translation": "Dans l'un des cours, j'ai, euh, dans l'un des modules, j'ai implémenté les deux avec AWS Azure.",
    "ts": 1770080552
  },
  "google|So AWS SageMaker actually helps you to create the entire entire end to end, uh, you'll be able to": {
    "translation": "Donc AWS SageMaker vous aide en fait à créer l'intégralité de bout en bout, euh, vous pourrez",
    "ts": 1770080552
  },
  "google|Uh, like you can also use a Jupyter notebook and probably create each and every thing.": {
    "translation": "Euh, comme si vous pouviez également utiliser un notebook Jupyter et probablement créer tout et n'importe quoi.",
    "ts": 1770080552
  },
  "google|We will try to write a modular code how an end to end project is basically created completely modular": {
    "translation": "Nous allons essayer d'écrire un code modulaire expliquant comment un projet de bout en bout est essentiellement créé de manière entièrement modulaire.",
    "ts": 1770080552
  },
  "google|my complete experiment tracking where we will be logging metrics, where we'll be logging each and every": {
    "translation": "mon expérience complète de suivi où nous enregistrerons les métriques, où nous enregistrerons chaque",
    "ts": 1770080552
  },
  "google|Right?": {
    "translation": "Droite?",
    "ts": 1770080552
  },
  "google|Along with this are how how a complete pipeline is basically created.": {
    "translation": "Parallèlement à cela, vous découvrirez comment un pipeline complet est essentiellement créé.",
    "ts": 1770080552
  },
  "google|how industries in industry.": {
    "translation": "comment les industries dans l'industrie.",
    "ts": 1770080552
  },
  "google|How to read a YAML file like params, YAML schema, YAML files.": {
    "translation": "Comment lire un fichier YAML comme les paramètres, le schéma YAML, les fichiers YAML.",
    "ts": 1770080552
  },
  "google|We specifically create we will be using YAML, YAML files.": {
    "translation": "Nous créons spécifiquement, nous utiliserons des fichiers YAML, YAML.",
    "ts": 1770080552
  },
  "google|We will be discussing about that and whenever we do the deployment right we do the deployment.": {
    "translation": "Nous en discuterons et chaque fois que nous effectuons le déploiement correctement, nous effectuons le déploiement.",
    "ts": 1770080552
  },
  "google|Now this GitHub action will actually help us to do the automated deployment okay.": {
    "translation": "Maintenant, cette action GitHub va réellement nous aider à effectuer le déploiement automatisé correctement.",
    "ts": 1770080552
  },
  "google|Uh, over here will we will try to visualize the, uh, model outputs or we'll try to write some rules": {
    "translation": "Euh, ici, nous allons essayer de visualiser les sorties du modèle ou nous allons essayer d'écrire quelques règles",
    "ts": 1770080552
  },
  "google|So here we will be also showing you that how the GitHub actions can be created.": {
    "translation": "Nous allons donc également vous montrer ici comment les actions GitHub peuvent être créées.",
    "ts": 1770080552
  },
  "google|You know what are workflows.": {
    "translation": "Vous savez ce que sont les flux de travail.",
    "ts": 1770080552
  },
  "google|Uh, so this is the overall thing because based on this particular visualization that we are created": {
    "translation": "Euh, donc c'est la chose globale parce que sur la base de cette visualisation particulière, nous sommes créés",
    "ts": 1770080552
  },
  "google|So I will be using something called as Grafana.": {
    "translation": "Je vais donc utiliser quelque chose appelé Grafana.",
    "ts": 1770080552
  },
  "google|know it is up to you, right.": {
    "translation": "sache que c'est à toi de décider, n'est-ce pas.",
    "ts": 1770080553
  },
  "google|And the best thing about this course is that everything over here, all the tools are open source,": {
    "translation": "Et le meilleur de ce cours, c'est que tout ici, tous les outils sont open source,",
    "ts": 1770080553
  },
  "google|all the tools are open source.": {
    "translation": "tous les outils sont open source.",
    "ts": 1770080553
  },
  "google|So that is what my main aim is to make it completely industry standard.": {
    "translation": "C’est donc mon objectif principal d’en faire un standard complet de l’industrie.",
    "ts": 1770080553
  },
  "google|be discussing over here.": {
    "translation": "discuter ici.",
    "ts": 1770080553
  },
  "google|Over here we will be using something called as GitHub action.": {
    "translation": "Ici, nous utiliserons quelque chose appelé action GitHub.",
    "ts": 1770080553
  },
  "google|Now many people will be asking, now let me just go through the list of all the MLOps tools we are using.": {
    "translation": "Maintenant, beaucoup de gens se demanderont, permettez-moi maintenant de passer en revue la liste de tous les outils MLOps que nous utilisons.",
    "ts": 1770080553
  },
  "google|So this specifically manages the airflow.": {
    "translation": "Cela gère donc spécifiquement le flux d’air.",
    "ts": 1770080553
  },
  "google|Then now there is something called as astronomer.": {
    "translation": "Alors maintenant, il y a quelque chose qui s'appelle un astronome.",
    "ts": 1770080553
  },
  "google|So astronomer actually provides a framework to manage the airflow okay.": {
    "translation": "L'astronome fournit donc un cadre pour gérer correctement le flux d'air.",
    "ts": 1770080553
  },
  "google|I've already told you, I'll make you understand that in the data ingestion, we'll be using MLflow": {
    "translation": "Je vous l'ai déjà dit, je vous fais comprendre que dans l'ingestion des données, nous utiliserons MLflow",
    "ts": 1770080553
  },
  "google|But my main aim is to bring modularity.": {
    "translation": "Mais mon objectif principal est d'apporter de la modularité.",
    "ts": 1770080553
  },
  "google|And along with this it provides a cloud platform to properly deploy the airflow.": {
    "translation": "Et parallèlement, il fournit une plate-forme cloud pour déployer correctement le flux d'air.",
    "ts": 1770080553
  },
  "google|Modularity in the.": {
    "translation": "Modularité dans le.",
    "ts": 1770080553
  },
  "google|So we'll be talking about astronomer then for my code tracking I will be using git right.": {
    "translation": "Nous parlerons donc d'astronome, puis pour le suivi de mon code, j'utiliserai correctement git.",
    "ts": 1770080553
  },
  "google|For the code tracking code commit I will be using git.": {
    "translation": "Pour la validation du code de suivi du code, j'utiliserai git.",
    "ts": 1770080553
  },
  "google|GitHub will be my repository because it is completely available for free Then AWS is the cloud platform": {
    "translation": "GitHub sera mon référentiel car il est entièrement disponible gratuitement Ensuite AWS est la plateforme cloud",
    "ts": 1770080553
  },
  "google|we'll be using.": {
    "translation": "nous allons utiliser.",
    "ts": 1770080553
  },
  "google|We'll also be using AWS SageMaker.": {
    "translation": "Nous utiliserons également AWS SageMaker.",
    "ts": 1770080553
  },
  "google|Our entire application will be using Docker's right.": {
    "translation": "L'ensemble de notre application utilisera les droits de Docker.",
    "ts": 1770080553
  },
  "google|As I said, to define workflows and all, we will be creating GitHub actions to Dockerize.": {
    "translation": "Comme je l'ai dit, pour définir les workflows et tout, nous allons créer des actions GitHub pour Dockerize.",
    "ts": 1770080553
  },
  "google|Then you have Grafana.": {
    "translation": "Ensuite, vous avez Grafana.",
    "ts": 1770080553
  },
  "google|This is specifically for visualization so that we'll be able to check the performance of our model.": {
    "translation": "Ceci est spécifiquement destiné à la visualisation afin que nous puissions vérifier les performances de notre modèle.",
    "ts": 1770080553
  },
  "google|So again understand that I'm not going to teach completely from basics.": {
    "translation": "Alors encore une fois, comprenez que je ne vais pas enseigner entièrement à partir des bases.",
    "ts": 1770080553
  },
  "google|Uh, I'm considering this that, you know, at least one NoSQL or one SQL database.": {
    "translation": "Euh, je considère que, vous savez, il y a au moins une base de données NoSQL ou SQL.",
    "ts": 1770080553
  },
  "google|Automated deployment.": {
    "translation": "Déploiement automatisé.",
    "ts": 1770080553
  },
  "google|How do you probably go ahead and create different different environments like you at or this that you": {
    "translation": "Comment allez-vous probablement aller de l'avant et créer différents environnements différents comme vous ou celui-ci dans lequel vous",
    "ts": 1770080553
  },
  "google|Because I'll directly be writing the query and all.": {
    "translation": "Parce que j'écrirai directement la requête et tout.",
    "ts": 1770080553
  },
  "google|use.": {
    "translation": "utiliser.",
    "ts": 1770080553
  },
  "google|Along with this, uh, some some some important, some some some basic understanding about git.": {
    "translation": "Parallèlement à cela, euh, certains sont importants, d'autres ont une compréhension de base de git.",
    "ts": 1770080553
  },
  "google|Okay, that will be more than sufficient.": {
    "translation": "D'accord, ce sera plus que suffisant.",
    "ts": 1770080553
  },
  "google|But anyhow, what I have done is that I've given recordings of the entire Python.": {
    "translation": "Quoi qu'il en soit, ce que j'ai fait, c'est que j'ai donné des enregistrements de l'intégralité de Python.",
    "ts": 1770080554
  },
  "google|I've given the recordings of entire git, and then step by step we will follow each and every like how": {
    "translation": "J'ai donné les enregistrements de tout Git, puis, étape par étape, nous suivrons chacun comme comment",
    "ts": 1770080554
  },
  "google|One more I forgot to add as a logo that is nothing but DAGs hub.": {
    "translation": "Un de plus que j'ai oublié d'ajouter comme logo qui n'est rien d'autre qu'un hub DAG.",
    "ts": 1770080554
  },
  "google|specifically in the experiment tracking airflow in the creation of the ETL pipeline.": {
    "translation": "en particulier dans l'expérience de suivi du flux d'air lors de la création du pipeline ETL.",
    "ts": 1770080554
  },
  "google|So DVC.": {
    "translation": "Donc DVC.",
    "ts": 1770080554
  },
  "google|And uh, we will also show you like if you are working in a collaborative environment, uh, how DAGs": {
    "translation": "Et euh, nous vous montrerons également, si vous travaillez dans un environnement collaboratif, comment les DAG",
    "ts": 1770080554
  },
  "google|course.": {
    "translation": "cours.",
    "ts": 1770080554
  },
  "google|So I hope you got an idea about the different, different things that we are going to cover in this": {
    "translation": "J'espère donc que vous avez une idée des différentes choses que nous allons aborder dans ce document.",
    "ts": 1770080554
  },
  "google|will be useful.": {
    "translation": "sera utile.",
    "ts": 1770080554
  },
  "google|I hope you enjoy this particular course.": {
    "translation": "J'espère que vous apprécierez ce cours particulier.",
    "ts": 1770080554
  },
  "google|You learn a lot of things.": {
    "translation": "On apprend beaucoup de choses.",
    "ts": 1770080554
  },
  "google|Everything will be practical oriented, and we'll try to develop all our projects like this end to end.": {
    "translation": "Tout sera orienté vers la pratique et nous essaierons de développer tous nos projets comme celui-ci de bout en bout.",
    "ts": 1770080554
  },
  "google|So yes, this was it from my side.": {
    "translation": "Alors oui, c'était ça de mon côté.",
    "ts": 1770080555
  },
  "google|I'll see you in the next video.": {
    "translation": "Je vous verrai dans la prochaine vidéo.",
    "ts": 1770080554
  },
  "google|So let's start the next module.": {
    "translation": "Alors commençons le module suivant.",
    "ts": 1770080554
  },
  "google|That is with respect to Python.": {
    "translation": "C'est en ce qui concerne Python.",
    "ts": 1770080554
  },
  "google|Databases we will be specifically using MongoDB.": {
    "translation": "Bases de données que nous utiliserons spécifiquement MongoDB.",
    "ts": 1770080554
  },
  "google|But before that we will go ahead and the installation of, you know, uh, the VSCode Anaconda and many": {
    "translation": "Mais avant cela, nous allons procéder à l'installation de, vous savez, euh, le VSCode Anaconda et bien d'autres.",
    "ts": 1770080554
  },
  "google|more things.": {
    "translation": "plus de choses.",
    "ts": 1770080554
  },
  "google|I'll see you all in the next video.": {
    "translation": "Je vous verrai tous dans la prochaine vidéo.",
    "ts": 1770080554
  },
  "google|And finally, the Python programming language, uh, is the programming language that we are going to": {
    "translation": "Et enfin, le langage de programmation Python, euh, est le langage de programmation que nous allons",
    "ts": 1770080554
  },
  "google|You should know databases like MongoDB or PostgreSQL, at least how to write some kind of queries.": {
    "translation": "Vous devez connaître les bases de données comme MongoDB ou PostgreSQL, au moins savoir écrire certaines sortes de requêtes.",
    "ts": 1770080554
  },
  "google|Now, as a prerequisite, you need to understand that at least you should know Python programming language.": {
    "translation": "Maintenant, comme condition préalable, vous devez comprendre qu’au moins vous devez connaître le langage de programmation Python.",
    "ts": 1770080554
  },
  "google|Similarly, we will go ahead and cover over there.": {
    "translation": "De même, nous allons continuer et couvrir là-bas.",
    "ts": 1770080554
  },
  "google|I've actually covered each and every modules over here.": {
    "translation": "J'ai en fait couvert chaque module ici.",
    "ts": 1770080554
  },
  "google|So it is a remote repository.": {
    "translation": "Il s'agit donc d'un référentiel distant.",
    "ts": 1770080554
  },
  "google|Um, thank you for considering the course.": {
    "translation": "Euh, merci d'avoir envisagé le cours.",
    "ts": 1770080555
  }
}